RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PPC</name>
      <description>Peripheral Protection Controller</description>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <description>PPC Control Registers</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RESP_CFG</name>
              <description>Response Configuration. This field configures the security violation response.
0 - Read-Zero Write Ignore (RZWI)
1 - Bus Error</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS1</name>
          <description>Status1 Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF07F3FF</resetMask>
          <fields>
            <field>
              <name>INDEX</name>
              <description>Index to indicate which peripheral region has first violated security access when INTR_PPC.SECURE_VIO=1. This field is only valid when INTR_PPC.SECURE_VIO=1.
Note that when STATUS1.TYPE=AHB_ERROR (3'd5), this field is not valid.</description>
              <bitRange>[9:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PC</name>
              <description>Indicates the master interface transaction PC value when violation is detected.
This field is only valid when INTR_PPC.SECURE_VIO=1.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TYPE</name>
              <description>N/A</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MS</name>
              <description>Indicates the Master ID of violating transfer.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS2</name>
          <description>Status2 Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Indicates the address of PPC violating transfer. STATUS2.ADDR status register is addition to PPC STATUS1 register. And all rules applicable for STATUS1 is applies to STATUS2 also.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK_MASK</name>
          <description>Locked Mask</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK_MASK</name>
              <description>A mask that indicates which protection contexts are 'locked'.  Once locked, a protection context cannot be unlocked until the next reset or power cycle. Bit i specifies the locked status for protection context i.
0: The protection context is unlocked.
1: The protection context is locked.

When a PC is locked, the PPC_PC_MASK, PPC_NS_ATT and PPC_S_P_ATT register bits for peripheral regions to which this PC has access can no longer be modified (PPC_NS_P_ATT is not subject to these restrictions).  The one exception to this is that PPC_PC_MASK bits associated with other protection contexts that are not themselves locked can still be cleared (but not set).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_PPC</name>
          <description>Interrupt</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SECURE_VIO</name>
              <description>HW sets this field to '1', when a security violation is detected.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_PPC_SET</name>
          <description>Interrupt set</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SECURE_VIO</name>
              <description>Write this field with '1' to set corresponding INTR_PPC field (a write of '0' has no effect).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_PPC_MASK</name>
          <description>Interrupt mask</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SECURE_VIO</name>
              <description>Mask for corresponding field in INTR_PPC register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_PPC_MASKED</name>
          <description>Interrupt masked</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SECURE_VIO</name>
              <description>Logical AND of corresponding INTR_PPC and INTR_PPC_MASK fields.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>1024</dim>
          <dimIncrement>4</dimIncrement>
          <name>PC_MASK[%s]</name>
          <description>Protection Context Mask</description>
          <addressOffset>0x1000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PC_MASK</name>
              <description>A mask that indicates which protection contexts have access to a peripheral region.  Bit i specifies the access for protection context i.
0: The protection context has no access to this region. 
1: The protection context has access to this region, subject to secure and privilege attribute constraints setup in PPC_NS_ATT, PPC_S_P_ATT, PPC_NS_P_ATT registers)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>4</dimIncrement>
          <name>NS_ATT[%s]</name>
          <description>Non-secure attribute</description>
          <addressOffset>0x2000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NS</name>
              <description>Non-Secure. Each bit indicates whether access to a peripheral region must be secure or non-secure:
IF SECURITY_AWARE=0
0 - allow only secure access to respective peripheral region.
1 - allow only non-secure access to respective peripheral region.
IF SECURITY_AWARE=1
0 - allow only secure access to respective peripheral region.
1 - allows both secure and non-secure access to respective peripheral region.
(Note that, depending on this setting the privilege access requirement for this region is specified in the corresponding PPC_S_P_ATT or PPC_NS_P_ATT register)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>4</dimIncrement>
          <name>S_P_ATT[%s]</name>
          <description>Secure Privilege Attribute</description>
          <addressOffset>0x2400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>S_P</name>
              <description>Secure Privilege. Each bit indicates whether access to a secure peripheral region requires privilege:
0 - allow only secure privileged access to respective peripheral region.
1 - allow only secure unprivileged or privileged access to respective peripheral region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>4</dimIncrement>
          <name>NS_P_ATT[%s]</name>
          <description>Non-secure Privilege Attribute</description>
          <addressOffset>0x4000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NS_P</name>
              <description>Non-Secure Privilege. Each bit indicates whether access to a non-secure peripheral region requires privilege:
0 - allow only non-secure privileged access to respective peripheral region.
1 - allow only non-secure unprivileged or privileged access to respective peripheral region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>157</dim>
          <dimIncrement>4</dimIncrement>
          <name>R_ADDR[%s]</name>
          <description>Region Address</description>
          <addressOffset>0x00005000</addressOffset>
          <register>
            <name>R_ADDR</name>
            <description>Region Address</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFC</resetMask>
            <fields>
              <field>
                <name>R_ADDR</name>
                <description>This field specifies the base address of the peripheral region. The region size is defined by R_ATTR.R_SIZE. A region of n Bytes mus be n Byte aligned. Therefore, some of the lesser significant address bits of ADDR must be '0's. E.g., a 64KB address region (R_SIZE is '15') must be 64 KByte aligned, and R_ADDR[13:0] must be '0's.</description>
                <bitRange>[31:2]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>157</dim>
          <dimIncrement>4</dimIncrement>
          <name>R_ATT[%s]</name>
          <description>Region Attribute</description>
          <addressOffset>0x00006000</addressOffset>
          <register>
            <name>R_ATT</name>
            <description>Region Attribute</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1F000000</resetMask>
            <fields>
              <field>
                <name>R_SIZE</name>
                <description>This field specifies the size of the peripheral region:
'0': Undefined.
'1': 4 B region (this is the smallest region size).
'2': 8 B region
'3': 16 B region
'4': 32 B region
'5': 64 B region
'6': 128 B region
'7': 256 B region
'8': 512 B region
'9': 1 KB region
'10': 2 KB region
'11': 4 KB region
'12': 8 KB region
'13': 16 KB region
'14': 32 KB region
'15': 64 KB region
'16': 128 KB region
'17': 256 KB region
'18': 512 KB region
'19': 1 MB region
'20': 2 MB region
'21': 4 MB region
'22': 8 MB region
'23': 16 MB region
'24': 32 MB region
'25': 64 MB region
'26': 128 MB region
'27': 256 MB region
'28': 512 MB region
'29': 1 GB region
'30': 2 GB region
'31': 4 GB region</description>
                <bitRange>[28:24]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
