RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="ICACHE0">
      <name>ICACHE1</name>
      <baseAddress>0x40104000</baseAddress>
    </peripheral>
    <peripheral>
      <name>CPUSS_PPU</name>
      <description>Power Policy Unit Registers for CPUSS</description>
      <baseAddress>0x40105000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PWPR</name>
          <description>Power Policy Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x108</resetValue>
          <resetMask>0x10F110F</resetMask>
          <fields>
            <field>
              <name>PWR_POLICY</name>
              <description>Power mode policy.  When static power mode transitions are enabled, PWR_DYN_EN is set to 0, this is the target power mode for the PPU.  When dynamic power mode transitions are enabled, PWR_DYN_EN is set to 1, this is the minimum power mode for the PPU.

This PPU supports the following modes: OFF(0), FULL_RET(5), ON(8).  Do not use WARM_RST(9) or other unsupported modes.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWR_DYN_EN</name>
              <description>Power mode dynamic transition enable.  When this bit is set to 1 dynamic transitions are enabled for power modes, allowing transitions to be initiated by changes on power mode DEVACTIVE inputs.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_EN</name>
              <description>N/A</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OP_POLICY</name>
              <description>N/A</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OP_DYN_EN</name>
              <description>N/A</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMER</name>
          <description>Power Mode Emulation Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EMU_EN</name>
              <description>N/A</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWSR</name>
          <description>Power Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x10F110F</resetMask>
          <fields>
            <field>
              <name>PWR_STATUS</name>
              <description>Power mode status.  These bits reflect the current power mode of the PPU.  See PPU_PWPR.PWR_POLICY for power mode enumeration.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWR_DYN_STATUS</name>
              <description>Power mode dynamic transition status.  When set to 1 power mode dynamic transitions are enabled.  There might be a delay in dynamic transitions becoming active or inactive if the PPU is transitioning when PWR_DYN_EN is programmed.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK_STATUS</name>
              <description>N/A</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OP_STATUS</name>
              <description>N/A</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OP_DYN_STATUS</name>
              <description>N/A</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DISR</name>
          <description>Device Interface Input Current Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF0007FF</resetMask>
          <fields>
            <field>
              <name>PWR_DEVACTIVE_STATUS</name>
              <description>Status of the power mode DEVACTIVE inputs.

There is one bit for each device interface Q-Channel DEVQACTIVE.  For example, bit 0 is for Q-channel device 0 DEVQACTIVE.  Refer to PPU_IDR0.DEVCHAN for device channel enumeration.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OP_DEVACTIVE_STATUS</name>
              <description>N/A</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISR</name>
          <description>Miscellaneous Input Current Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF01</resetMask>
          <fields>
            <field>
              <name>PCSMPACCEPT_STATUS</name>
              <description>The status of the PCSMPACCEPT input.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DEVACCEPT_STATUS</name>
              <description>Status of the device interface DEVACCEPT inputs.  

