RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
It is mandatory to check for STATUS.PWR_DONE to become 1 once this PWR_MACRO_DTL register contents are changed to ensure SRAM mode transition is completed successfully.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_MACRO_CTL_LOCK</name>
          <description>SRAM power partition power control Lock</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>PWR_MACRO_CTL_LOCK</name>
              <description>Prohibits Read/Write access to PWR_MACRO_CTL register when this field is not equal to 0.  Requires at least two different writes to unlock.
Note that this field is 2 bits to force multiple writes only.
By default AHB reads/writes to PWR_MACRO_CTL register are locked.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CHG</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR0</name>
                  <description>Clears bit 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR1</name>
                  <description>Clears bit 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET01</name>
                  <description>Sets both bits 0 and 1</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_DELAY_CTL</name>
          <description>SRAM power switch power up &amp; sequence delay</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x9020009</resetValue>
          <resetMask>0xFFFF03FF</resetMask>
          <fields>
            <field>
              <name>UP</name>
              <description>Number of IMO clock cycles delay needed after power domain power up</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ0_DELAY</name>
              <description>Number of IMO clock cycles delay needed for sequence-0 of SRAM power transition</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ1_DELAY</name>
              <description>Number of IMO clock cycles delay needed for sequence-1 of SRAM power transition</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <name>MPC</name>
          <description>MPC Memory Protection Controller registers</description>
          <addressOffset>0x00004000</addressOffset>
          <register>
            <name>CFG</name>
            <description>Config register with error response, RegionID PPC_MPC_MAIN is the security owner PC. The error response configuration is located in CFG.RESPONSE, only one such configuration exists applying to all protection contexts in the system.</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x10</resetMask>
            <fields>
              <field>
                <name>RESPONSE</name>
                <description>Response Configuration for Security and PC violations
0: Read-Zero Write Ignore (RAZ/WI)
1: Bus Error</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR</name>
            <description>Interrupt</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>VIOLATION</name>
                <description>HW sets this field to '1', when a security violation is detected. 
SW writes '1' to this field to clear</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_SET</name>
            <description>Interrupt set</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>VIOLATION</name>
                <description>SW write this field with '1' to set INTR register (a write of '0' has no effect).</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_MASK</name>
            <description>Interrupt mask</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>VIOLATION</name>
                <description>Mask for corresponding field in INTR register.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_MASKED</name>
            <description>Interrupt masked</description>
            <addressOffset>0x1C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>VIOLATION</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_INFO1</name>
            <description>Infor about violation</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Full address of the access that caused violation</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_INFO2</name>
            <description>Infor about violation</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xCF07FFFF</resetMask>
            <fields>
              <field>
                <name>HMASTER</name>
                <description>The master ID of the master that made the access causing the violation (taken from the AHB HMASTER signal)</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>HNONSEC</name>
                <description>The security status of the access address causing the violation (taken from the AHB5 HNONSEC signal).</description>
                <bitRange>[16:16]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG_NS</name>
                <description>The secure/non-secure configuration of the block access attempt causing the violation.</description>
                <bitRange>[17:17]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>HWRITE</name>
                <description>The R/W status from which the violating access was made.</description>
                <bitRange>[18:18]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>HAUSER</name>
                <description>The protection context from which the violating access was made (taken from the AHB5 HAUSER signal).</description>
                <bitRange>[27:24]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SECURITY_VIOLATION</name>
                <description>This bit is set when a secure access was done to a non-secure block of memory, or a non-secure access was done to a secure block of memory.</description>
                <bitRange>[30:30]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ACCESS_VIOLATION</name>
                <description>This bit is set when a read or write transaction was done from a protection context that does not have access to this block of memory.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRL</name>
            <description>Control register with lock bit and auto-increment only (Separate CTRL for each PC depends on access_pc)</description>
            <addressOffset>0x100</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x100</resetValue>
            <resetMask>0x80000100</resetMask>
            <fields>
              <field>
                <name>AUTO_INC</name>
                <description>Auto-increment BLK_IDX by 1 for this protection context as a side effect of each read/write access to BLK_LUT</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LOCK</name>
                <description>Security lockdown for this protection context. Software can set this bit but not clear it once set.  When set, write operations to BLK_LUT are not possible  from this protection context. Setting LOCK also blocks writes to CTRL itself (for that PC copy). All writes are ignored.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BLK_MAX</name>
            <description>Max value of block-based index register</description>
            <addressOffset>0x104</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Maximum value of block-based index register.  The number and size blocks in an MPC is design time configurable and for embedded memories defaults to covering the entire memory using 4kB blocks; See product datasheet for details on protection of external memories.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BLK_CFG</name>
            <description>Block size &amp; initialization in progress</description>
            <addressOffset>0x108</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x80000000</resetValue>
            <resetMask>0x8000000F</resetMask>
            <fields>
              <field>
                <name>BLOCK_SIZE</name>
                <description>Block size of individually protected blocks (0: 32B, 1: 64B, ... up to 15: 1MB)
Block size= (1&lt;&lt;(BLOCK_SIZE+5))
The number and size blocks in an MPC is design time configurable and for embedded memories defaults to covering the entire memory using 4kB blocks; see product datasheet for details on protection of external memories.</description>
                <bitRange>[3:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>INIT_IN_PROGRESS</name>
                <description>During initialization INIT_IN_PROGRESS is '1' and MMIO register accesses to BLK_LUT is blocked (BLK_IDX increment is also ignored). The block attributes are retained in DeepSleep (and obviously Active) power mode. Initialization is only required from a power mode in which the block attributes are not retained. E.g., initialization is required for a cold boot (after a Power-on-Reset).
HW initializes the block attributes: the NS attributes are set to '0' (secure), the R attributes are set to '1' (read access allowed) and the W attributes are set to '1' (write access allowed). During initialization, the MPC supports memory accesses (memory accesses are NOT blocked) with the initialization block attribute values as mentioned above. This e.g. allows MPC initialization to proceed in parallel with boot program memory accesses (as opposed to serializing the two), improving device boot time.
HW initializes the block attributes NS to 1 in case SECEXT = 0.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BLK_IDX</name>
            <description>Index of 32-block group accessed through BLK_LUT (Separate IDX for each PC depending on access_pc)</description>
            <addressOffset>0x10C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Index value for accessing block-based lookup table using BLK_LUT. Programming out of LUT range is an user error and it loops back to '0' once overflow occurs.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BLK_LUT</name>
            <description>NS status for 32 blocks at BLK_IDX with PC=&lt;access_pc&gt;</description>
            <addressOffset>0x110</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ATTR_NS0</name>
                <description>NS bit for block 0 based on BLK_IDX</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS1</name>
                <description>NS bit for block 1 based on BLK_IDX</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS2</name>
                <description>NS bit for block 2 based on BLK_IDX</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS3</name>
                <description>NS bit for block 3 based on BLK_IDX</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS4</name>
                <description>NS bit for block 4 based on BLK_IDX</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS5</name>
                <description>NS bit for block 5 based on BLK_IDX</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS6</name>
                <description>NS bit for block 6 based on BLK_IDX</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS7</name>
                <description>NS bit for block 7 based on BLK_IDX</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS8</name>
                <description>NS bit for block 8 based on BLK_IDX</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS9</name>
                <description>NS bit for block 9 based on BLK_IDX</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS10</name>
                <description>NS bit for block 10 based on BLK_IDX</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS11</name>
                <description>NS bit for block 11 based on BLK_IDX</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS12</name>
                <description>NS bit for block 12 based on BLK_IDX</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS13</name>
                <description>NS bit for block 13 based on BLK_IDX</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS14</name>
                <description>NS bit for block 14 based on BLK_IDX</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS15</name>
                <description>NS bit for block 15 based on BLK_IDX</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS16</name>
                <description>NS bit for block 16 based on BLK_IDX</description>
                <bitRange>[16:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS17</name>
                <description>NS bit for block 17 based on BLK_IDX</description>
                <bitRange>[17:17]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS18</name>
                <description>NS bit for block 18 based on BLK_IDX</description>
                <bitRange>[18:18]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS19</name>
                <description>NS bit for block 19 based on BLK_IDX</description>
                <bitRange>[19:19]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS20</name>
                <description>NS bit for block 20 based on BLK_IDX</description>
                <bitRange>[20:20]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS21</name>
                <description>NS bit for block 21 based on BLK_IDX</description>
                <bitRange>[21:21]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS22</name>
                <description>NS bit for block 22 based on BLK_IDX</description>
                <bitRange>[22:22]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS23</name>
                <description>NS bit for block 23 based on BLK_IDX</description>
                <bitRange>[23:23]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS24</name>
                <description>NS bit for block 24 based on BLK_IDX</description>
                <bitRange>[24:24]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS25</name>
                <description>NS bit for block 25 based on BLK_IDX</description>
                <bitRange>[25:25]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS26</name>
                <description>NS bit for block 26 based on BLK_IDX</description>
                <bitRange>[26:26]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS27</name>
                <description>NS bit for block 27 based on BLK_IDX</description>
                <bitRange>[27:27]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS28</name>
                <description>NS bit for block 28 based on BLK_IDX</description>
                <bitRange>[28:28]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS29</name>
                <description>NS bit for block 29 based on BLK_IDX</description>
                <bitRange>[29:29]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS30</name>
                <description>NS bit for block 30 based on BLK_IDX</description>
                <bitRange>[30:30]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS31</name>
                <description>NS bit for block 31 based on BLK_IDX</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
