RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PROMC</name>
      <description>Patchable ROM Controller</description>
      <baseAddress>0x40140000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <description>Control</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>ROM_WS</name>
              <description>Wait states.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WS_0</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WS_1</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WS_2</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WS_3</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_CTL</name>
          <description>Patch control</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x80000000</resetMask>
          <fields>
            <field>
              <name>ENABLED</name>
              <description>Patching enable:
'0': Disabled.
'1': Enabled.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_STATUS</name>
          <description>Patch status</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x80000000</resetMask>
          <fields>
            <field>
              <name>PATCH_IDX</name>
              <description>Match index of the patch structure that produced the most recent valid address match. The index is in the range [0, PATCH_NR-1].
Only matches with PATCH_STRUCT_CTL.VALID=1 are considered.</description>
              <bitRange>[8:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PATCH_VALID</name>
              <description>Validity of MATCH_IDX:
'0': Not valid.
'1': Valid.
Only matches with PATCH_STRUCT_CTL.VALID=1 are considered.
Note: The rationale of that bit is to inform initial value of IDX has been overwritten.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_CFG</name>
          <description>Patch design time configuration info</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x303FF</resetMask>
          <fields>
            <field>
              <name>PATCH_NR</name>
              <description>Patch number; i.e. number of patch structures. Legal range (linear): [0, 512].</description>
              <bitRange>[9:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PATCH_SIZE</name>
              <description>Patch size; i.e. number of Bytes that are 'patched' by a single patch structure. This value is same as the word size of ROM and fixed at design time.
'0': 8 Bytes.
'1': 16 Bytes. &lt;- choice for this ROM (128 bit)
'2': 32 Bytes.
'3': 64 Bytes.</description>
              <bitRange>[17:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PATCH_SROM</name>
          <description>Patch SROM boundary</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOUNDARY</name>
              <description>Specifies the boundary between non-patchable and patchable SROM memory locations (the address specifies the first patchable SROM memory location). The SROM is divided into two partitions:
- The first/lower partition is non-patchable. This partition may be used to provide an unmutable 'root of trust'.
- The second/high partition is patchable. This partition may be used for FW that requires updates.

Note: Higher bit indices reflect the SROM location in the memory map. When BOUNDARY equals the SROM base address, the complete SROM is patchable. When ADDR equal the SROM base address plus the SROM size, the complete SROM is non-patchable.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>512</dim>
          <dimIncrement>4</dimIncrement>
          <name>PATCH_STRUCT_CTL[%s]</name>
          <description>Patch structure control</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>VALID</name>
              <description>Patch structure validity:
'0': Not valid.
'1': Valid.

Note: VALID uses the bit field '0' location, rather than the more typical bit field '31' location. This architecture decision was made to allow for SROM location anywhere in a 32-bit address space, and not require extensive address manipulatin when accessing PATCH_CTL.MATCH_ADDR.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH_ADDR</name>
              <description>Match address. SROM accesses are matched/compared to this address. An address match results into patching/redirection of the SROM access (if CTL.ENABLED is '1'): the SROM access is redirected to access the PATCH_DATA register with the according index of the matching patch structure. Specifically, given an index i, the PATCH_DATA access address is given by: PATCH_DATA.ADDR + i * 'patch size', where patch size is the number of Bytes that are patched by a single patch structure (2 ^ (3+PATCH_CFG.PATCH_SIZE)).

The MATCH_ADDR[] bit range is dependent on two design time configuration parameters:
- The lowest index is determined by PATCH_SIZE. E.g., a 8 Byte patch size uses '3' as the lowest bit index, a 16 Byte patch size uses '4' as the lowest bit index, etc. Unused lower bit indices are '0'.
- The highest index is determined by the SROM size as specified by SROM_MASK (the next power of two multiple of the SROM size). E.g., a 0xffff:0000 mask specifies a 64 KByte SROM size and uses '15' as the highest bit index, a 0xfff0:0000 mask specifies a 1 MByte SROM size and uses '19' as the highest bit index, etc. Unused higher bit indices reflect the SROM location in the address space.</description>
              <bitRange>[31:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <name>MPC</name>
          <description>MPC Memory Protection Controller registers</description>
          <addressOffset>0x00001000</addressOffset>
          <register>
            <name>CFG</name>
            <description>Config register with error response, RegionID PPC_MPC_MAIN is the security owner PC. The error response configuration is located in CFG.RESPONSE, only one such configuration exists applying to all protection contexts in the system.</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x10</resetMask>
            <fields>
              <field>
                <name>RESPONSE</name>
                <description>Response Configuration for Security and PC violations
0: Read-Zero Write Ignore (RAZ/WI)
1: Bus Error</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR</name>
            <description>Interrupt</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>VIOLATION</name>
                <description>HW sets this field to '1', when a security violation is detected. 
SW writes '1' to this field to clear</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_SET</name>
            <description>Interrupt set</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>VIOLATION</name>
                <description>SW write this field with '1' to set INTR register (a write of '0' has no effect).</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_MASK</name>
            <description>Interrupt mask</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>VIOLATION</name>
                <description>Mask for corresponding field in INTR register.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_MASKED</name>
            <description>Interrupt masked</description>
            <addressOffset>0x1C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>VIOLATION</name>
                <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_INFO1</name>
            <description>Infor about violation</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Full address of the access that caused violation</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_INFO2</name>
            <description>Infor about violation</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xCF07FFFF</resetMask>
            <fields>
              <field>
                <name>HMASTER</name>
                <description>The master ID of the master that made the access causing the violation (taken from the AHB HMASTER signal)</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>HNONSEC</name>
                <description>The security status of the access address causing the violation (taken from the AHB5 HNONSEC signal).</description>
                <bitRange>[16:16]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CFG_NS</name>
                <description>The secure/non-secure configuration of the block access attempt causing the violation.</description>
                <bitRange>[17:17]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>HWRITE</name>
                <description>The R/W status from which the violating access was made.</description>
                <bitRange>[18:18]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>HAUSER</name>
                <description>The protection context from which the violating access was made (taken from the AHB5 HAUSER signal).</description>
                <bitRange>[27:24]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SECURITY_VIOLATION</name>
                <description>This bit is set when a secure access was done to a non-secure block of memory, or a non-secure access was done to a secure block of memory.</description>
                <bitRange>[30:30]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ACCESS_VIOLATION</name>
                <description>This bit is set when a read or write transaction was done from a protection context that does not have access to this block of memory.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRL</name>
            <description>Control register with lock bit and auto-increment only (Separate CTRL for each PC depends on access_pc)</description>
            <addressOffset>0x100</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x100</resetValue>
            <resetMask>0x80000100</resetMask>
            <fields>
              <field>
                <name>AUTO_INC</name>
                <description>Auto-increment BLK_IDX by 1 for this protection context as a side effect of each read/write access to BLK_LUT</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LOCK</name>
                <description>Security lockdown for this protection context. Software can set this bit but not clear it once set.  When set, write operations to BLK_LUT are not possible  from this protection context. Setting LOCK also blocks writes to CTRL itself (for that PC copy). All writes are ignored.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BLK_MAX</name>
            <description>Max value of block-based index register</description>
            <addressOffset>0x104</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Maximum value of block-based index register.  The number and size blocks in an MPC is design time configurable and for embedded memories defaults to covering the entire memory using 4kB blocks; See product datasheet for details on protection of external memories.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BLK_CFG</name>
            <description>Block size &amp; initialization in progress</description>
            <addressOffset>0x108</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x80000000</resetValue>
            <resetMask>0x8000000F</resetMask>
            <fields>
              <field>
                <name>BLOCK_SIZE</name>
                <description>Block size of individually protected blocks (0: 32B, 1: 64B, ... up to 15: 1MB)
Block size= (1&lt;&lt;(BLOCK_SIZE+5))
The number and size blocks in an MPC is design time configurable and for embedded memories defaults to covering the entire memory using 4kB blocks; see product datasheet for details on protection of external memories.</description>
                <bitRange>[3:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>INIT_IN_PROGRESS</name>
                <description>During initialization INIT_IN_PROGRESS is '1' and MMIO register accesses to BLK_LUT is blocked (BLK_IDX increment is also ignored). The block attributes are retained in DeepSleep (and obviously Active) power mode. Initialization is only required from a power mode in which the block attributes are not retained. E.g., initialization is required for a cold boot (after a Power-on-Reset).
HW initializes the block attributes: the NS attributes are set to '0' (secure), the R attributes are set to '1' (read access allowed) and the W attributes are set to '1' (write access allowed). During initialization, the MPC supports memory accesses (memory accesses are NOT blocked) with the initialization block attribute values as mentioned above. This e.g. allows MPC initialization to proceed in parallel with boot program memory accesses (as opposed to serializing the two), improving device boot time.
HW initializes the block attributes NS to 1 in case SECEXT = 0.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BLK_IDX</name>
            <description>Index of 32-block group accessed through BLK_LUT (Separate IDX for each PC depending on access_pc)</description>
            <addressOffset>0x10C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Index value for accessing block-based lookup table using BLK_LUT. Programming out of LUT range is an user error and it loops back to '0' once overflow occurs.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
