RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
          <register>
            <name>BLK_LUT</name>
            <description>NS status for 32 blocks at BLK_IDX with PC=&lt;access_pc&gt;</description>
            <addressOffset>0x110</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ATTR_NS0</name>
                <description>NS bit for block 0 based on BLK_IDX</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS1</name>
                <description>NS bit for block 1 based on BLK_IDX</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS2</name>
                <description>NS bit for block 2 based on BLK_IDX</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS3</name>
                <description>NS bit for block 3 based on BLK_IDX</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS4</name>
                <description>NS bit for block 4 based on BLK_IDX</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS5</name>
                <description>NS bit for block 5 based on BLK_IDX</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS6</name>
                <description>NS bit for block 6 based on BLK_IDX</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS7</name>
                <description>NS bit for block 7 based on BLK_IDX</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS8</name>
                <description>NS bit for block 8 based on BLK_IDX</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS9</name>
                <description>NS bit for block 9 based on BLK_IDX</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS10</name>
                <description>NS bit for block 10 based on BLK_IDX</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS11</name>
                <description>NS bit for block 11 based on BLK_IDX</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS12</name>
                <description>NS bit for block 12 based on BLK_IDX</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS13</name>
                <description>NS bit for block 13 based on BLK_IDX</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS14</name>
                <description>NS bit for block 14 based on BLK_IDX</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS15</name>
                <description>NS bit for block 15 based on BLK_IDX</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS16</name>
                <description>NS bit for block 16 based on BLK_IDX</description>
                <bitRange>[16:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS17</name>
                <description>NS bit for block 17 based on BLK_IDX</description>
                <bitRange>[17:17]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS18</name>
                <description>NS bit for block 18 based on BLK_IDX</description>
                <bitRange>[18:18]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS19</name>
                <description>NS bit for block 19 based on BLK_IDX</description>
                <bitRange>[19:19]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS20</name>
                <description>NS bit for block 20 based on BLK_IDX</description>
                <bitRange>[20:20]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS21</name>
                <description>NS bit for block 21 based on BLK_IDX</description>
                <bitRange>[21:21]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS22</name>
                <description>NS bit for block 22 based on BLK_IDX</description>
                <bitRange>[22:22]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS23</name>
                <description>NS bit for block 23 based on BLK_IDX</description>
                <bitRange>[23:23]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS24</name>
                <description>NS bit for block 24 based on BLK_IDX</description>
                <bitRange>[24:24]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS25</name>
                <description>NS bit for block 25 based on BLK_IDX</description>
                <bitRange>[25:25]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS26</name>
                <description>NS bit for block 26 based on BLK_IDX</description>
                <bitRange>[26:26]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS27</name>
                <description>NS bit for block 27 based on BLK_IDX</description>
                <bitRange>[27:27]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS28</name>
                <description>NS bit for block 28 based on BLK_IDX</description>
                <bitRange>[28:28]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS29</name>
                <description>NS bit for block 29 based on BLK_IDX</description>
                <bitRange>[29:29]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS30</name>
                <description>NS bit for block 30 based on BLK_IDX</description>
                <bitRange>[30:30]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR_NS31</name>
                <description>NS bit for block 31 based on BLK_IDX</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ROT_CTRL</name>
            <description>Control register with lock bit and auto-increment only</description>
            <addressOffset>0x200</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x100</resetValue>
            <resetMask>0x80000100</resetMask>
            <fields>
              <field>
                <name>AUTO_INC</name>
                <description>Auto-increment BLK_IDX by 1 for each read/write of ROT_BLK_LUT</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LOCK</name>
                <description>Security lockdown for the root-of-trust configuration registers. Software can set this bit but not clear it once set.  When set, write operations to ROT_BLK_LUT are not possible. Write is ignored.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ROT_CFG</name>
            <description>Sets block-size to match memory size (external memory only)</description>
            <addressOffset>0x204</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>BLOCK_SIZE</name>
                <description>Block size of individually protected blocks (0: 32B, 1: 64B, ...up to 15:1 MB)
Block size= (1&lt;&lt;(BLOCK_SIZE+5))
The number and size blocks in an MPC is design time configurable and for external memories defaults to covering the entire memory using 4kB blocks; see product datasheet for details on protection of external memories.</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ROT_BLK_MAX</name>
            <description>Max value of block-based index register for ROT</description>
            <addressOffset>0x208</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Maximum value of block-based index register.  The number and size blocks in an MPC is design time configurable and for embedded memories defaults to covering the entire memory using 4kB blocks; see product datasheet for details on protection of external memories.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ROT_BLK_CFG</name>
            <description>Same as BLK_CFG</description>
            <addressOffset>0x20C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x80000000</resetValue>
            <resetMask>0x8000000F</resetMask>
            <fields>
              <field>
                <name>BLOCK_SIZE</name>
                <description>Block size of individually protected blocks (0: 32B, 1: 64B, ...up to 15:1MB)
Block size= (1&lt;&lt;(BLOCK_SIZE+5))
The number and size blocks in an MPC is design time configurable and for embedded memories defaults to covering the entire memory using 4kB blocks; see product datasheet for details on protection of external memories.</description>
                <bitRange>[3:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>INIT_IN_PROGRESS</name>
                <description>During initialization INIT_IN_PROGRESS is '1' and MMIO register accesses to ROT_BLK_LUT is RAZWI. The block attributes are retained in DeepSleep (and obviously Active) power mode. Initialization is only required from a power mode in which the block attributes are not retained. E.g., initialization is required for a cold boot (after a Power-on-Reset).
HW initializes the block attributes: the NS attributes are set to '0' (secure), the R attributes are set to '1' (read access allowed) and the W attributes are set to '1' (write access allowed). During initialization, the MPC supports memory accesses (memory accesses are NOT blocked) with the initialization block attribute values as mentioned above. This e.g. allows MPC initialization to proceed in parallel with boot program memory accesses (as opposed to serializing the two), improving device boot time.
HW initializes the block attributes NS to 1 in case SECEXT = 0.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ROT_BLK_IDX</name>
            <description>Index of 8-block group accessed through ROT_BLK_LUT_*</description>
            <addressOffset>0x210</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Index value for accessing block-based lookup table using ROT_BLK_LUT. Programming out of LUT range is an user error and it loops back to '0' once overflow occurs.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ROT_BLK_PC</name>
            <description>Protection context of 8-block group accesses through ROT_BLK_LUT</description>
            <addressOffset>0x214</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>PC</name>
                <description>Specify PC values for ROT_BLK_IDX and ROT_BLK_LUT</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ROT_BLK_LUT</name>
            <description>(R,W,NS) bits for 8 blocks at ROT_BLK_IDX for PC=ROT_BKL_PC</description>
            <addressOffset>0x218</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x77777777</resetMask>
            <fields>
              <field>
                <name>ATTR0</name>
                <description>W/R/NS bits for block 0 indicated by ROT_BLK_IDX for ROT_BLK_PC PC</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR1</name>
                <description>W/R/NS bits for block 1 indicated by ROT_BLK_IDX for ROT_BLK_PC PC</description>
                <bitRange>[6:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR2</name>
                <description>W/R/NS bits for block 2 indicated by ROT_BLK_IDX for ROT_BLK_PC PC</description>
                <bitRange>[10:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR3</name>
                <description>W/R/NS bits for block 3 indicated by ROT_BLK_IDX for ROT_BLK_PC PC</description>
                <bitRange>[14:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR4</name>
                <description>W/R/NS bits for block 4 indicated by ROT_BLK_IDX for ROT_BLK_PC PC</description>
                <bitRange>[18:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR5</name>
                <description>W/R/NS bits for block 5 indicated by ROT_BLK_IDX for ROT_BLK_PC PC</description>
                <bitRange>[22:20]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR6</name>
                <description>W/R/NS bits for block 6 indicated by ROT_BLK_IDX for ROT_BLK_PC PC</description>
                <bitRange>[26:24]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ATTR7</name>
                <description>W/R/NS bits for block 7 indicated by ROT_BLK_IDX for ROT_BLK_PC PC</description>
                <bitRange>[30:28]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>8192</dim>
          <dimIncrement>4</dimIncrement>
          <name>PATCH_DATA[%s]</name>
          <description>Patch data RAM</description>
          <addressOffset>0x8000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Patch data word.

Depending on the selected PATCH_SIZE multiple words of PATCH_DATA form one patch entry.
E.g. in this controller the PATCH_SIZE is 16 byte, equal to the with of the SROM. Thus 4 words of PATCH_DATA are one entry, which is read intead of the ROM data in case patch got enabled.

In case of smaller portion than PATCH_SIZE should be replaced, the original content of the entire SROM line can be copied into one patch entry and only the desired portion can be changed.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
