RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPUSS</name>
      <description>SYSCPUSS registers</description>
      <baseAddress>0x401C0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>16384</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ioss_interrupts_gpio_0</name>
        <description>GPIO Port Interrupt #0</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>ioss_interrupts_gpio_1</name>
        <description>GPIO Port Interrupt #1</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>ioss_interrupts_gpio_2</name>
        <description>GPIO Port Interrupt #2</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>ioss_interrupts_gpio_3</name>
        <description>GPIO Port Interrupt #3</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>ioss_interrupts_gpio_4</name>
        <description>GPIO Port Interrupt #4</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>ioss_interrupts_gpio_5</name>
        <description>GPIO Port Interrupt #5</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>ioss_interrupt_vdd</name>
        <description>GPIO Supply Detect Interrupt</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>ioss_interrupt_gpio</name>
        <description>GPIO All Ports</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>scb_0_interrupt</name>
        <description>Serial Communication Block #0 (DeepSleep capable)</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>srss_interrupt_mcwdt_0</name>
        <description>Multi Counter Watchdog Timer interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>srss_interrupt_backup</name>
        <description>Backup domain interrupt</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>srss_interrupt</name>
        <description>Other combined Interrupts for srss (LVD and CLKCAL, CLKCAL only supported in Active mode)</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_ipc_dpslp_0</name>
        <description>cpuss Inter Process Communication Interrupt #0</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_ipc_dpslp_1</name>
        <description>cpuss Inter Process Communication Interrupt #1</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>keyscan_interrupt</name>
        <description>mxkeyscan interrupt for keyscan edge or fifo thresh to WIC in M33</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>srss_interrupt_wdt</name>
        <description>Interrupt from WDT</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>btss_interrupt_btss_ipc</name>
        <description>interrupt from BTSS IPC</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>scb_1_interrupt</name>
        <description>Serial Communication Block #1</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>scb_2_interrupt</name>
        <description>Serial Communication Block #2</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_dw0_0</name>
        <description>cpuss DataWire #0, Channel #0</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_dw0_1</name>
        <description>cpuss DataWire #0, Channel #1</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_dw0_2</name>
        <description>cpuss DataWire #0, Channel #2</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_dw0_3</name>
        <description>cpuss DataWire #0, Channel #3</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_dw0_4</name>
        <description>cpuss DataWire #0, Channel #4</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_dw0_5</name>
        <description>cpuss DataWire #0, Channel #5</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_dw0_6</name>
        <description>cpuss DataWire #0, Channel #6</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_dw0_7</name>
        <description>cpuss DataWire #0, Channel #7</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_dw0_8</name>
        <description>cpuss DataWire #0, Channel #8</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_dw0_9</name>
        <description>cpuss DataWire #0, Channel #9</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_dw0_10</name>
        <description>cpuss DataWire #0, Channel #10</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_dw0_11</name>
        <description>cpuss DataWire #0, Channel #11</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_dw0_12</name>
        <description>cpuss DataWire #0, Channel #12</description>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_dw0_13</name>
        <description>cpuss DataWire #0, Channel #13</description>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_dw0_14</name>
        <description>cpuss DataWire #0, Channel #14</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_dw0_15</name>
        <description>cpuss DataWire #0, Channel #15</description>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupt_mpc_promc</name>
        <description>PROMC Int</description>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupt_ppu_sramc0</name>
        <description>PPU SRAM0</description>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupt_mpc_sramc0</name>
        <description>MPC SRAM0</description>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupt_cm33_0_fp</name>
        <description>CM33 0 Floating Point Interrupt</description>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_cm33_0_cti_0</name>
        <description>CM33-0 CTI interrupt outputs</description>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupts_cm33_0_cti_1</name>
        <description>CM33-1 CTI interrupt outputs</description>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupt_exp_br_ahb_error</name>
        <description>EXPANSION BRIDGE AHB Error interrupt</description>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_0_interrupts_0</name>
        <description>TCPWM #0, Counter #0</description>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_0_interrupts_1</name>
        <description>TCPWM #0, Counter #1</description>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_0_interrupts_256</name>
        <description>TCPWM #0, Counter #256</description>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_0_interrupts_257</name>
        <description>TCPWM #0, Counter #257</description>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_0_interrupts_258</name>
        <description>TCPWM #0, Counter #258</description>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_0_interrupts_259</name>
        <description>TCPWM #0, Counter #259</description>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_0_interrupts_260</name>
        <description>TCPWM #0, Counter #260</description>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_0_interrupts_261</name>
        <description>TCPWM #0, Counter #261</description>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_0_interrupts_262</name>
        <description>TCPWM #0, Counter #262</description>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>smif_interrupt_normal</name>
        <description>Serial Memory Interface interrupt</description>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>smif_interrupt_mpc</name>
        <description>Serial Memory Interface interrupt</description>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>tdm_0_interrupts_rx_0</name>
        <description>TDM0 Audio interrupt RX</description>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>tdm_0_interrupts_tx_0</name>
        <description>TDM0 Audio interrupt TX</description>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>pdm_0_interrupts_0</name>
        <description>PDM0/PCM0 Audio interrupt</description>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>pdm_0_interrupts_1</name>
        <description>PDM0/PCM0 Audio interrupt</description>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>srss_interrupt_main_ppu</name>
        <description>SRSS Main PPU Interrupt</description>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>peri_interrupt_ppc</name>
        <description>PERI PPC Interrupt</description>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>peri_interrupt_ahb_error</name>
        <description>PERI AHB Interrupt</description>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>lin_0_interrupts_0</name>
        <description>LIN Interrupt, Channel #0</description>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>lin_0_interrupts_1</name>
        <description>LIN Interrupt, Channel #1</description>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>crypto_interrupt_error</name>
        <description>Crypto Interrupt</description>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>cpuss_interrupt_ppu_cpuss</name>
        <description>CPUSS PPU Interrupt</description>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>canfd_0_interrupts0_0</name>
        <description>CAN #0, Interrupt #0, Channel #0</description>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>canfd_0_interrupts1_0</name>
        <description>CAN #0, Interrupt #1, Channel #0</description>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>canfd_0_interrupt0</name>
        <description>Can #0, Consolidated interrupt #0</description>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>adcmic_interrupt_adcmic</name>
        <description>ADCMIC interrupt</description>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>btss_interrupt_btss_exception</name>
        <description>interrupt indicating BTSS has encountered exception</description>
        <value>68</value>
      </interrupt>
      <registers>
        <register>
          <name>IDENTITY</name>
          <description>Identity</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>P</name>
              <description>This field specifies the privileged setting ('0': user mode; '1': privileged mode) of the transfer that reads the register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NS</name>
              <description>This field specifies the security setting ('0': secure mode; '1': non-secure mode) of the transfer that reads the register.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PC</name>
              <description>This field specifies the protection context of the transfer that reads the register.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MS</name>
              <description>This field specifies the bus master identifier of the transfer that reads the register.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRODUCT_ID</name>
          <description>Product identifier and version (same as CoreSight RomTables)</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFF</resetMask>
          <fields>
            <field>
              <name>FAMILY_ID</name>
              <description>Family ID. Common ID for a product family.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR_REV</name>
              <description>Major Revision, starts with 1, increments with all layer tape-out (implemented with metal ECO-able  tie-off)</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MINOR_REV</name>
              <description>Minor Revision, starts with 1, increments with metal layer only tape-out (implemented with metal ECO-able  tie-off)</description>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DP_STATUS</name>
          <description>Debug port status</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x4</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SWJ_CONNECTED</name>
              <description>Specifies if the SWJ debug port is connected; i.e. debug host interface is active:
'0': Not connected/not active.
'1': Connected/active.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SWJ_DEBUG_EN</name>
              <description>Specifies if SWJ debug is enabled, i.e. CDBGPWRUPACK is '1' and thus debug clocks are on:
'0': Disabled.
'1': Enabled.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SWJ_JTAG_SEL</name>
              <description>Specifies if the JTAG or SWD interface is selected. This signal is valid when DP_CTL.PTM_SEL is '0' (SWJ mode selected) and SWJ_CONNECTED is '1' (SWJ is connected).
'0': SWD selected.
'1': JTAG selected.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFF_CTL</name>
          <description>Buffer control</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WRITE_BUFF</name>
              <description>Specifies if write transfer can be buffered in the bus infrastructure bridges:
'0': Write transfers are not buffered, independent of the transfer's bufferable attribute.
'1': Write transfers can be buffered, if the transfer's bufferable attribute indicates that the transfer is a bufferable/posted write.

This bit will control only the IPs which use mxambatk AHB2AHB bridge (mxambatk_ahb2ahb) and it will NOT control the buffering that may be happening in bus infrastructure components used from ARM SIE200.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAL_SUP_SET</name>
          <description>Calibration support set and read</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Read without side effect, write 1 to set</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAL_SUP_CLR</name>
          <description>Calibration support clear and reset</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Read side effect: when read all bits are cleared, write 1 to clear a specific bit 
Note: no exception for the debug host, it also causes the read side effect</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INFRA_CTL</name>
          <description>Infrastructure Control</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CLOCK_FORCE</name>
              <description>Force Infrastructure clock gating to be always ON.
0: Disabled
1: Enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTICK_S_CTL</name>
          <description>Secure SysTick timer control</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000147</resetValue>
          <resetMask>0xC3FFFFFF</resetMask>
          <fields>
            <field>
              <name>TENMS</name>
              <description>Specifies the number of clock source cycles (minus 1) that make up 10 ms. E.g., for a 32,768 Hz reference clock, TENMS is 328 - 1 = 327.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLOCK_SOURCE</name>
              <description>Specifies an external clock source:
'0': The low frequency clock 'clk_lf' is selected. The precision of this clock depends on whether the low frequency clock source is a SRSS internal RC oscillator (imprecise) or a device external crystal oscillator (precise).
'1': The internal main oscillator (IMO) clock 'clk_imo' is selected. The MXS40 platform uses a fixed frequency IMO clock.
o '2': The external crystal oscillator (ECO) clock 'clk_eco' is selected.
'3': The SRSS 'clk_timer' is selected ('clk_timer' is a divided/gated version of 'clk_hf' or 'clk_imo').

