RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MS_CTL_1_2</name>
      <description>Master control registers</description>
      <baseAddress>0x401C4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>16384</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>6</dim>
          <dimIncrement>16</dimIncrement>
          <name>MS[%s]</name>
          <description>Master protection context control</description>
          <headerStructName>MS</headerStructName>
          <addressOffset>0x00000000</addressOffset>
          <register>
            <name>CTL</name>
            <description>Master 'x' protection context control</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x3</resetValue>
            <resetMask>0xFFFF0003</resetMask>
            <fields>
              <field>
                <name>P</name>
                <description>Privileged setting ('0': user mode; '1': privileged mode).

Notes:
This field is ONLY used for masters that do NOT provide their own user/privileged access control attribute.
The default/reset field value provides privileged mode access capabilities.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>NS</name>
                <description>Master security controller configuration.
0: Bus master is secure. Master can send both secure and non-secure transfers. Accesses to secure addresses are not blocked and the security flag, HNONSEC, is set accordingly. 
1: Bus master is non-secure. Master can send only non-secure
transfers. Access to secure addresses, that is, outside the
Uncheck regions, are blocked.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PC_MASK</name>
                <description>Protection context mask for protection contexts '15' down to '0'. Bit PC_MASK[i] indicates if the MS_PC_STRUCT[x].PC[3:0] protection context field can be set to the value 'i':
- PC_MASK[i] is '0': MS_PC_STRUCT[x].PC[3:0] can NOT be set to 'i'; and PC[3:0] is not changed.
- PC_MASK[i] is '1': MS_PC_STRUCT[x].PC[3:0] can be set to 'i'.

Note: When CM33_0 CM33_PC_CTL.VALID[i] is '1' (the associated protection context handler is valid), write transfers to PC_MASK[i] always write '0', regardless of data written. This ensures that when valid protection context handlers are used to enter protection contexts 0, 1, 2 or 3 through HW (HW modifies MS_PC_STRUCT[x].PC[3:0] on entry of the handler), it is NOT possible for SW to enter those protection contexts.</description>
                <bitRange>[31:16]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>6</dim>
          <dimIncrement>16</dimIncrement>
          <name>MS_PC[%s]</name>
          <description>Master protection context value</description>
          <headerStructName>MS_PC</headerStructName>
          <addressOffset>0x00001000</addressOffset>
          <register>
            <name>PC</name>
            <description>Master 'x' protection context value</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF000F</resetMask>
            <fields>
              <field>
                <name>PC</name>
                <description>Active protection context (PC). Modifications to this field are constrained by the associated  MS_CTL_STRUCT[x].CTL.PC_MASK value. PC[3:0] can be set to 'i' only if the corresponding mask bit (PC_MASK[i]) is '1'.

The CM33_0 PC register is special: the PC field is modifiable by BOTH HW and SW (for all other masters, the PC field is modifiable by SW ONLY. For CM33_0 PC field HW modifications, the following holds:
* On entry of a CM33_PC0/1/2/3_HANDLER exception/interrupt handler:
   IF (the new PC is the same as MS_PC_STRUCT[0].PC)
       PC is not affected; PC_SAVED is not affected.
   ELSE IF (CM33_PC_CTL.VALID[MS_PC_STRUCT[0].PC])
       An AHB5 bus error is generated for the exception handler fetch;
       PC is not affected; PC_SAVED is not affected.
   ELSE
       PC = 'new PC'; PC_SAVED = PC (push operation).
* On entry of any other exception/interrupt handler:
   PC = PC_SAVED; PC_SAVED is not affected (pop operation).

Note that the CM33_PC0/1/2/3_HANDLER and CM33_PC_CTL registers are part of mxcm33 MMIO registers.

Note: this field is NOT used by the DW controllers, DMA controllers as they inherit the protection context from master that configures the corresponding channel.</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PC_SAVED</name>
                <description>Saved protection context. Modifications to this field are constrained by the associated MS_CTL_STRUCT[x].CTL.PC_MASK.

Note: this field is ONLY used by the CM33_0.</description>
                <bitRange>[19:16]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PC_READ_MIR</name>
            <description>Master 'x' protection context value read mirror register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF000F</resetMask>
            <fields>
              <field>
                <name>PC</name>
                <description>Read-only mirror of PC.PC</description>
                <bitRange>[3:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>PC_SAVED</name>
                <description>Read-only mirror of PC.PC_SAVED</description>
                <bitRange>[19:16]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CODE_MS0_MSC_ACG_CTL</name>
          <description>CODE_MS0 master security Controller &amp; ACG configuration</description>
          <addressOffset>0x2000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>CFG_GATE_RESP</name>
              <description>Response type when the ACG is blocking the incoming transfers:
0: Waited transfer 
1: Error response</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_RESP</name>
              <description>Reseponse type when transfers are not allowed by MSC.
0: Read as zero, write ignore.
1: Error response.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_MS0_MSC_ACG_CTL</name>
          <description>SYS_MS0  master security Controller &amp; ACG configuration</description>
          <addressOffset>0x2010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>CFG_GATE_RESP</name>
              <description>Response type when the ACG is blocking the incoming transfers:
0: Waited transfer 
1: Error response</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_RESP</name>
              <description>Reseponse type when transfers are not allowed by MSC.
0: Read as zero, write ignore.
1: Error response.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_MS1_MSC_ACG_CTL</name>
          <description>SYS_MS1  master security Controller &amp; ACG configuration</description>
          <addressOffset>0x2014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>CFG_GATE_RESP</name>
              <description>Response type when the ACG is blocking the incoming transfers:
0: Waited transfer 
1: Error response</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_RESP</name>
              <description>Reseponse type when transfers are not allowed by MSC.
0: Read as zero, write ignore.
1: Error response.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXP_MS_MSC_ACG_CTL</name>
          <description>EXP_MS  master security Controller &amp; ACG configuration</description>
          <addressOffset>0x2020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>CFG_GATE_RESP</name>
              <description>Response type when the ACG is blocking the incoming transfers:
0: Waited transfer 
1: Error response</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_RESP</name>
              <description>Reseponse type when transfers are not allowed by MSC.
0: Read as zero, write ignore.
1: Error response.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC0_MSC_ACG_CTL</name>
          <description>DMAC-0  master security Controller &amp; ACG configuration</description>
          <addressOffset>0x2030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>CFG_GATE_RESP</name>
              <description>Response type when the ACG is blocking the incoming transfers:
0: Waited transfer 
1: Error response</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_RESP</name>
              <description>Reseponse type when transfers are not allowed by MSC.
0: Read as zero, write ignore.
1: Error response.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC1_MSC_ACG_CTL</name>
          <description>DMAC-1  master security Controller &amp; ACG configuration</description>
          <addressOffset>0x2040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>CFG_GATE_RESP</name>
              <description>Response type when the ACG is blocking the incoming transfers:
0: Waited transfer 
1: Error response</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_RESP</name>
              <description>Reseponse type when transfers are not allowed by MSC.
0: Read as zero, write ignore.
1: Error response.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
