RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
fOUT = (FEEDBACK_DIV + FRAC_EN*FRAC_DIV/2^24)  * (fREF / REFERENCE_DIV) / (OUTPUT_DIV)

0: Block is disabled.  When the PLL disables, hardware controls the bypass mux as described in BYPASS_SEL, before disabling the PLL circuit.
1: Block is enabled</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG2</name>
            <description>400MHz PLL Configuration Register 2</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF0FFFFFF</resetMask>
            <fields>
              <field>
                <name>FRAC_DIV</name>
                <description>Control bits for fractional divider.  This value is interpreted as a fraction of the PFD frequency, i.e. fPFD * (FRAC_DIV/2^24).  This field can be dynamically updated within the 1000ppm control limit. It takes up to 115 AHB cycles to transfer the setting to the PLL, and writes that occur faster may be silently ignored and require the application to write again after the previous update has finished.  Reading the register returns the accepted value.  The PLL will start targeting the new value, but it may take significant time (milliseconds) to stabilize at the new average value.  Do not change the FRAC_DIV setting while the PLL is initially locking.</description>
                <bitRange>[23:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FRAC_DITHER_EN</name>
                <description>N/A</description>
                <bitRange>[30:28]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FRAC_EN</name>
                <description>Enables fractional division mode.  When using fractional division mode, see CLK_PLL400M_CONFIG.LOCK_DELAY for an additional configuration requirement.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG3</name>
            <description>400MHz PLL Configuration Register 3</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x910703FF</resetMask>
            <fields>
              <field>
                <name>SSCG_DEPTH</name>
                <description>N/A</description>
                <bitRange>[9:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SSCG_RATE</name>
                <description>N/A</description>
                <bitRange>[18:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SSCG_DITHER_EN</name>
                <description>Enables dithering during spreading.
0: disabled
1: enabled</description>
                <bitRange>[24:24]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SSCG_MODE</name>
                <description>N/A</description>
                <bitRange>[28:28]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SSCG_EN</name>
                <description>Enables spreading mode.  When using spreading, see CLK_PLL400M_CONFIG.LOCK_DELAY for an additional configuration requirement.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>400MHz PLL Status Register</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3</resetMask>
            <fields>
              <field>
                <name>LOCKED</name>
                <description>PLL Lock Indicator</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>UNLOCK_OCCURRED</name>
                <description>This bit sets whenever the PLL Lock bit goes low, and stays set until cleared by firmware.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>PWR_CBUCK_CTL</name>
          <description>Core Buck Control Register</description>
          <addressOffset>0x1C00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1114</resetValue>
          <resetMask>0x1F1F</resetMask>
          <fields>
            <field>
              <name>CBUCK_VSEL</name>
              <description>Voltage output selection.  This register is only reset by XRES, HIBERNATE wakeup, or supply supervision reset.   The actual CBUCK voltage is the maximum of this setting, the settings for all enabled step-down regulators (see PWR_SDR*_CTL), and the minimum DEEPSLEEP setting (which is not user configurable).  These settings follow the formula (0.76+0.02*CBUCK_VSEL).  
0: 0.76V, 1: 0.78V, 2: 0.80V, 3: 0.82V, 4: 0.84V, 5: 0.86V, 6: 0.88V, 7: 0.90V, 8: 0.92V, 9: 0.94V, 10: 0.96V, 11: 0.98V, 12: 1.00V, 13: 1.02V, 14: 1.04V, 15: 1.06V, 16: 1.08V, 17: 1.10V, 18: 1.12V, 19: 1.14V, 20: 1.16V, 21: 1.18V, 22: 1.20V, 23: 1.22V, 24: 1.24V, 25: 1.26V, 26: 1.28V, 27: 1.30V, 28: 1.32V, 29: 1.34V, 30: 1.36V, 31: 1.38V.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CBUCK_MODE</name>
              <description>CBUCK mode.  Low ripple (high power) modes are intended for analog that needs low ripple.  Low power mode is suitable for digital processing.
The CBUCK mode is defined as = {mode*_sr_mode, mode*_sr_hp_submode[1:0], mode*_sr_lp_submode[1:0]}
The actual CBUCK mode is the maximum of this setting and the settings of all enabled step-down regulators.
0x11: HP, PFM Auto, High-Low (default Active)
0x01: LP, PFM Auto, High-Low (DeepSleep)
See s40power BROS for other settings</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_CBUCK_CTL2</name>
          <description>Core Buck Control Register 2</description>
          <addressOffset>0x1C04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF0000000</resetMask>
          <fields>
            <field>
              <name>CBUCK_OVERRIDE</name>
              <description>Forces the CBUCK to use the settings in PWR_CBUCK_CTL register, ignoring the other hardware requests.  This can be used as part of a firmware algorithm to change the voltage of an enabled stepdown regulator.  This bit is cleared by any reset.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CBUCK_PAUSE</name>
              <description>Pauses new dynamic CBUCK transitions.  An already started transition will complete, but new dynamic transitions are paused.  This can be used as part of a firmware sequence to change the voltage setting of an enabled stepdown regulator.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CBUCK_COPY_SETTINGS</name>
              <description>Copies the current CBUCK composite state to the fields in  PWR_CBUCK_CTL register (CBUCK_VSEL and CBUCK_MODE).  It is recommended to pause transitions using CBUCK_PAUSE to ensure the state does not change near the copy.  After it is copied, the CBUCK_OVERRIDE bit can be used to hold the CBUCK in the current state.  Note, reading this bit always returns 0.
0: no change
1: copy settings.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CBUCK_USE_SETTINGS</name>
              <description>Causes the settings in  PWR_CBUCK_CTL register to be included in the CBUCK setting decision.  Can be used to override the normal hardware voltage behavior.  Regardless of this bit, the extra settings in  PWR_CBUCK_CTL register are not used during DEEPSLEEP.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_CBUCK_CTL3</name>
          <description>Core Buck Control Register 3</description>
          <addressOffset>0x1C08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x80000000</resetMask>
          <fields>
            <field>
              <name>CBUCK_INRUSH_SEL</name>
              <description>CBUCK inrush limit selection.
0: 10mA limit.
1: 100mA limit.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_CBUCK_STATUS</name>
          <description>Core Buck Status Register</description>
          <addressOffset>0x1C0C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x80000000</resetMask>
          <fields>
            <field>
              <name>PMU_DONE</name>
              <description>Indicates the power management unit is finished with a transition.
0: PMU busy
1: PMU done</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_SDR0_CTL</name>
          <description>Step Down Regulator 0 Control Register</description>
          <addressOffset>0x1C10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8A09E34</resetValue>
          <resetMask>0xBCFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDR0_CBUCK_VSEL</name>
              <description>Minimum voltage selection of CBUCK when using this SDR0 (see PWR_CBUCK_CTL for voltage table).  The voltage must be 60mV higher than the SDR output or the regulator output may bypass.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDR0_CBUCK_MODE</name>
              <description>Minimum CBUCK mode when using SDR0 (see PWR_CBUCK_CTL for mode table).
Default Active</description>
              <bitRange>[9:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDR0_CBUCK_DPSLP_VSEL</name>
              <description>DeepSleep voltage selection of CBUCK (see PWR_CBUCK_CTL for voltage table).  The voltage must be 60mV higher than the SDR output or the regulator output may bypass.</description>
              <bitRange>[14:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDR0_CBUCK_DPSLP_MODE</name>
              <description>DeepSleep CBUCK mode when using SDR0 (see PWR_CBUCK_CTL for mode table).
Default DeepSleep</description>
              <bitRange>[19:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDR0_VSEL</name>
              <description>SDR0 output voltage.
0: 0.850V, 1: 0.875V, 2: 0.900V, 3: 0.925V, 4: 0.950V, 5: 0.975V, 6: 1.000V, 7: 1.025V, 8: 1.050V, 9: 1.075V, 10: 1.100V, 11: 1.125V, 12: 1.150V, 13: 1.175V, 14: 1.200V, 15: 1.225V</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDR0_DPSLP_VSEL</name>
              <description>SDR0 output voltage during DeepSleep.  (See SDR0_VSEL for voltage table).</description>
              <bitRange>[29:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDR0_ALLOW_BYPASS</name>
              <description>SDR0 bypass control.  
0: Force SDR0 to regulate.
1: Allow SDR0 to bypass if the actual CBUCK voltage matches SDR0_CBUCK_VSEL.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_SDR1_CTL</name>
          <description>Step Down Regulator 1 Control Register</description>
          <addressOffset>0x1C14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x400A1114</resetValue>
          <resetMask>0xC00F1F1F</resetMask>
          <fields>
            <field>
              <name>SDR1_CBUCK_VSEL</name>
              <description>Minimum voltage selection of CBUCK when using this SDR1 (see PWR_CBUCK_CTL for voltage table).  The voltage must be 60mV higher than the SDR output or the regulator output may bypass.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDR1_CBUCK_MODE</name>
              <description>Minimum CBUCK mode when using SDR1 (see PWR_CBUCK_CTL for mode table).</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDR1_VSEL</name>
              <description>SDR1 output voltage.
0: 0.850V, 1: 0.875V, 2: 0.900V, 3: 0.925V, 4: 0.950V, 5: 0.975V, 6: 1.000V, 7: 1.025V, 8: 1.050V, 9: 1.075V, 10: 1.100V, 11: 1.125V, 12: 1.150V, 13: 1.175V, 14: 1.200V, 15: 1.225V</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDR1_HW_SEL</name>
              <description>Selects hardware control for SDR1.  
0: SDR1_ENABLE controls SDR1.  Hardware controls are ignored.
1: SDR1_ENABLE is ignored and a hardware signal is used instead.  Selecting this on products that don't have supporting hardware will disable SDR1.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDR1_ENABLE</name>
              <description>Enable for SDR1.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_HVLDO0_CTL</name>
          <description>HVLDO0 Control Register</description>
          <addressOffset>0x1C30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000007</resetValue>
          <resetMask>0xC000000F</resetMask>
          <fields>
            <field>
              <name>HVLDO0_VSEL</name>
              <description>HVLDO0 output voltage.
0: 1.8V, 1: 1.9V, 2: 2.0V, 3: 2.1V, 4: 2.2V, 5: 2.3V, 6: 2.4V, 7: 2.5V, 8: 2.6V, 9: 2.7V, 10: 2.8V, 11: 2.9V, 12: 3.0V, 13: 3.1V, 14: 3.2V, 15: 3.3V</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HVLDO0_HW_SEL</name>
              <description>Selects hardware control for HVLDO0.  
0: HVLDO0_ENABLE controls SDR1.  Hardware controls are ignored.
1: HVLDO0_ENABLE is ignored and a hardware signal is used instead.  Selecting this on products that don't have supporting hardware will disable HVLDO0.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HVLDO0_ENABLE</name>
              <description>HVLDO0 enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TST_XRES_SECURE</name>
          <description>SECURE TEST and FIRMWARE TEST Key control register</description>
          <addressOffset>0x2054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xE00F0FFF</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>Data byte to be set into either SECURE TEST or FIRMWARE TEST key.  Must not be changed in the same write that is toggling any of the *_WR bits below,</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FW_WR</name>
              <description>Latch enables for each of the 4 bytes in the 32-bit FIRMWARE TEST key.  Must be toggled high and then low while keeping DATA8 to the correct value.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SECURE_WR</name>
              <description>Latch enables for each of the 4 bytes in the 32-bit SECURE TEST key.  Must be toggled high and then low while keeping DATA8 to the correct value.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FW_KEY_OK</name>
              <description>Indicates that the 32-bit FIRMWARE TEST key is observing the correct key.  Firmware key is reset by (A)XRES and STRUCT_XRES.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_KEY_OK</name>
              <description>Indicates that the 32-bit SECURE TEST key is observing the correct key.  Secure key is not reset, but it will establish low after a deep power cycle that causes it to lose its written state.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_DISABLE</name>
              <description>Disables the SECURE TEST key entry capability until next reset.   Must not be set in the same write when any of the above *_WR bits are set or toggling.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_TRIM_CBUCK_CTL</name>
          <description>CBUCK Trim Register</description>
          <addressOffset>0x20AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x107</resetValue>
          <resetMask>0x1F1F</resetMask>
          <fields>
            <field>
              <name>CBUCK_DPSLP_VSEL</name>
              <description>The CBUCK voltage setting to use during DEEPSLEEP.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CBUCK_DPSLP_MODE</name>
              <description>The CBUCK mode setting to use during DEEPSLEEP.</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_TRIM_ECO_CTL</name>
          <description>ECO Trim Register</description>
          <addressOffset>0x301C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F0000</resetValue>
          <resetMask>0x3F0000</resetMask>
          <fields>
            <field>
              <name>ITRIM</name>
              <description>Current Trim</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_TRIM_ILO1_CTL</name>
          <description>ILO1 Trim Register</description>
          <addressOffset>0x3220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x52C</resetValue>
          <resetMask>0xF3F</resetMask>
          <fields>
            <field>
              <name>ILO1_FTRIM</name>
              <description>ILO1 frequency trims.  LSB step size is 1.5 percent (typical) of the frequency.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ILO1_MONTRIM</name>
              <description>ILO1 internal monitor trim.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
