RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWRMODE</name>
      <description>SRSS Power Mode Control Registers</description>
      <baseAddress>0x40210000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>16</dim>
          <dimIncrement>16</dimIncrement>
          <name>PD[%s]</name>
          <description>Power Domain Dependency Sense Register</description>
          <addressOffset>0x00000000</addressOffset>
          <register>
            <name>PD_SENSE</name>
            <description>Dependency Sense Register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>PD_ON</name>
                <description>Each bit &lt;i&gt; indicates whether PD&lt;j&gt; is directly kept on when PD&lt;i&gt; is on.  Indirect dependency is still possible if multiple direct dependencies work together to create a transitive relationship.  For example, if PD1 depends upon PD2; and PD2 dpends upon PD3; then PD1 indirectly depends upon PD3 regardless of whether there is a direct dependency from PD3 to PD1.  Some bits are implemented as constants, and some bits are implemented as user-configurable registers.  Refer to PD_SPT register to see how each bit is implemented.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PD_SPT</name>
            <description>Dependency Support Register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>PD_FORCE_ON</name>
                <description>Each bit &lt;i&gt; indicates whether PD&lt;j&gt; is always kept on when PD&lt;i&gt; is on for sense bits that are not configurable.  For configurable bits, this indicates the reset value of the configurable bit.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>PD_CONFIG_ON</name>
                <description>Each bit &lt;i&gt; indicates whether PD&lt;j&gt; can be configured on when PD&lt;i&gt; is on.</description>
                <bitRange>[31:16]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PPU_MAIN</name>
          <description>Power Policy Unit for Active Domain</description>
          <addressOffset>0x00001000</addressOffset>
          <cluster>
            <name>PPU_MAIN</name>
            <description>Power Policy Unit Registers for the main power domain (VCCACT_PD)</description>
            <addressOffset>0x00000000</addressOffset>
            <register>
              <name>PWPR</name>
              <description>Power Policy Register</description>
              <addressOffset>0x0</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x108</resetValue>
              <resetMask>0x10F110F</resetMask>
              <fields>
                <field>
                  <name>PWR_POLICY</name>
                  <description>Power mode policy.  When static power mode transitions are enabled, PWR_DYN_EN is set to 0, this is the target power mode for the PPU.  When dynamic power mode transitions are enabled, PWR_DYN_EN is set to 1, this is the minimum power mode for the PPU.

This PPU supports the following modes: OFF(0), MEM_RET(2), FULL_RET(5), ON(8).  Do not use WARM_RST(9) or other unsupported modes.</description>
                  <bitRange>[3:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PWR_DYN_EN</name>
                  <description>Power mode dynamic transition enable.  For main PPU, keep this bit 1.</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>LOCK_EN</name>
                  <description>N/A</description>
                  <bitRange>[12:12]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OP_POLICY</name>
                  <description>N/A</description>
                  <bitRange>[19:16]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OP_DYN_EN</name>
                  <description>N/A</description>
                  <bitRange>[24:24]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>PMER</name>
              <description>Power Mode Emulation Register</description>
              <addressOffset>0x4</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x1</resetMask>
              <fields>
                <field>
                  <name>EMU_EN</name>
                  <description>N/A</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>PWSR</name>
              <description>Power Status Register</description>
              <addressOffset>0x8</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x10F110F</resetMask>
              <fields>
                <field>
                  <name>PWR_STATUS</name>
                  <description>Power mode status.  These bits reflect the current power mode of the PPU.  See PPU_PWPR.PWR_POLICY for power mode enumeration.</description>
                  <bitRange>[3:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>PWR_DYN_STATUS</name>
                  <description>Power mode dynamic transition status.  When set to 1 power mode dynamic transitions are enabled.  There might be a delay in dynamic transitions becoming active or inactive if the PPU is transitioning when PWR_DYN_EN is programmed.</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>LOCK_STATUS</name>
                  <description>N/A</description>
                  <bitRange>[12:12]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>OP_STATUS</name>
                  <description>N/A</description>
                  <bitRange>[19:16]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>OP_DYN_STATUS</name>
                  <description>N/A</description>
                  <bitRange>[24:24]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>DISR</name>
              <description>Device Interface Input Current Status Register</description>
              <addressOffset>0x10</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFF0007FF</resetMask>
              <fields>
                <field>
                  <name>PWR_DEVACTIVE_STATUS</name>
                  <description>Status of the power mode DEVACTIVE inputs.

There is one bit for each device interface Q-Channel DEVQACTIVE.  For example, bit 0 is for Q-channel device 0 DEVQACTIVE.  Refer to PPU_IDR0.DEVCHAN for device channel enumeration.</description>
                  <bitRange>[10:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>OP_DEVACTIVE_STATUS</name>
                  <description>N/A</description>
                  <bitRange>[31:24]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MISR</name>
              <description>Miscellaneous Input Current Status Register</description>
              <addressOffset>0x14</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFFFF01</resetMask>
              <fields>
                <field>
                  <name>PCSMPACCEPT_STATUS</name>
                  <description>The status of the PCSMPACCEPT input.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DEVACCEPT_STATUS</name>
                  <description>Status of the device interface DEVACCEPT inputs.  

