RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
There is one bit for each device interface DEVQACCEPTn.  For example, bit 8 is for Q-Channel 0 DEVQACCEPTn and bit 9 for Q-Channel 1 DEVQACCEPTn.   Refer to PPU_IDR0.DEVCHAN for device channel enumeration.</description>
                  <bitRange>[15:8]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DEVDENY_STATUS</name>
                  <description>Status of the device interface DEVDENY inputs.  

There is one bit for each device interface DEVQDENY.  For example, bit 16 is for Q-Channel 0 DEVQDENY, and bit 17 for Q-Channel 1 DEVQDENY.  Refer to PPU_IDR0.DEVCHAN for device channel enumeration.</description>
                  <bitRange>[23:16]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>STSR</name>
              <description>Stored Status Register</description>
              <addressOffset>0x18</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFF</resetMask>
              <fields>
                <field>
                  <name>STORED_DEVDENY</name>
                  <description>Status of the DEVDENY signals from the last device interface Q-Channel transition.  For Q-Channel:  There is one bit for each device interface DEVQDENY.  For example, bit 0 is for Q-Channel 0 DEVQDENY, and bit 1 for Q-Channel 1 DEVQDENY.  Refer to PPU_DISR.PWR_DEVACTIVE_STATUS for device enumeration.</description>
                  <bitRange>[7:0]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>UNLK</name>
              <description>Unlock register</description>
              <addressOffset>0x1C</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x1</resetMask>
              <fields>
                <field>
                  <name>UNLOCK</name>
                  <description>N/A</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>PWCR</name>
              <description>Power Configuration Register</description>
              <addressOffset>0x20</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x101</resetValue>
              <resetMask>0xFF07FFFF</resetMask>
              <fields>
                <field>
                  <name>DEVREQEN</name>
                  <description>When set to 1 enables the device interface handshake for transitions.  All available bits are reset to 1. 

There is one bit for each device interface channel.  For example, bit 0 is for Q-Channel 0, and bit 1 is for Q-Channel 1.  Refer to PPU_IDR0.DEVCHAN for device channel enumeration.</description>
                  <bitRange>[7:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PWR_DEVACTIVEEN</name>
                  <description>These bits enable the power mode DEVACTIVE inputs.  When a bit is to 1 the related DEVACTIVE input is enabled, when set to 0 it is disabled.  All available bits are reset to 1.  

There is one bit for each device interface Q-Channel DEVQACTIVE.  For example, bit 8 is for the Q-Channel 0 DEVQACTIVE, and bit 9 for the Q-Channel 1 DEVQACTIVE.  Refer to PPU_IDR0.DEVCHAN for device channel enumeration.</description>
                  <bitRange>[18:8]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OP_DEVACTIVEEN</name>
                  <description>N/A</description>
                  <bitRange>[31:24]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>PTCR</name>
              <description>Power Mode Transition Configuration Register</description>
              <addressOffset>0x24</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x3</resetMask>
              <fields>
                <field>
                  <name>WARM_RST_DEVREQEN</name>
                  <description>Transition behavior between ON and WARM_RST.  This bit should not be modified when the PPU is in WARM_RST, or if the PPU is performing a transition, otherwise PPU behavior is UNPREDICTABLE.  
0:  The PPU does not perform a device interface handshake when transitioning between ON and WARM_RST.  
1:  The PPU performs a device interface handshake when transitioning between ON and WARM_RST.  This disables all Q-Channels for this transition.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DBG_RECOV_PORST_EN</name>
                  <description>N/A</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>IMR</name>
              <description>Interrupt Mask Register</description>
              <addressOffset>0x30</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x2</resetValue>
              <resetMask>0x3F</resetMask>
              <fields>
                <field>
                  <name>STA_POLICY_TRN_IRQ_MASK</name>
                  <description>Static full policy transition completion event mask.  For main PPU, this bit has no function because no static transitions are supported (see PWPR.PWR_DYN_EN).</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>STA_ACCEPT_IRQ_MASK</name>
                  <description>Static transition acceptance event mask.  For main PPU, keep this bit 1 to mask the event, otherwise the interrupt may trigger a wakeup.</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>STA_DENY_IRQ_MASK</name>
                  <description>Static transition denial event mask.</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>EMU_ACCEPT_IRQ_MASK</name>
                  <description>N/A</description>
                  <bitRange>[3:3]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>EMU_DENY_IRQ_MASK</name>
                  <description>N/A</description>
                  <bitRange>[4:4]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>LOCKED_IRQ_MASK</name>
                  <description>N/A</description>
                  <bitRange>[5:5]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>AIMR</name>
              <description>Additional Interrupt Mask Register</description>
              <addressOffset>0x34</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x6</resetValue>
              <resetMask>0x1F</resetMask>
              <fields>
                <field>
                  <name>UNSPT_POLICY_IRQ_MASK</name>
                  <description>Unsupported Policy event mask.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DYN_ACCEPT_IRQ_MASK</name>
                  <description>Dynamic transition acceptance event mask.  For main PPU, keep this bit 1 to mask the event, otherwise the interrupt that occurs when entering a low power mode may trigger a wakeup.</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DYN_DENY_IRQ_MASK</name>
                  <description>Dynamic transition denial event mask.</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>STA_POLICY_PWR_IRQ_MASK</name>
                  <description>N/A</description>
                  <bitRange>[3:3]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>STA_POLICY_OP_IRQ_MASK</name>
                  <description>N/A</description>
                  <bitRange>[4:4]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>ISR</name>
              <description>Interrupt Status Register</description>
              <addressOffset>0x38</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFF07FFBF</resetMask>
              <fields>
                <field>
                  <name>STA_POLICY_TRN_IRQ</name>
                  <description>Static full policy transition completion event status.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>STA_ACCEPT_IRQ</name>
                  <description>Static transition acceptance event status.</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>STA_DENY_IRQ</name>
                  <description>Static transition denial event status.</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>EMU_ACCEPT_IRQ</name>
                  <description>N/A</description>
                  <bitRange>[3:3]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>EMU_DENY_IRQ</name>
                  <description>N/A</description>
                  <bitRange>[4:4]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>LOCKED_IRQ</name>
                  <description>N/A</description>
                  <bitRange>[5:5]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OTHER_IRQ</name>
                  <description>Indicates there is an interrupt event pending in the Additional Interrupt Status Register (PPU_AISR).</description>
                  <bitRange>[7:7]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>PWR_ACTIVE_EDGE_IRQ</name>
                  <description>N/A</description>
                  <bitRange>[18:8]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OP_ACTIVE_EDGE_IRQ</name>
                  <description>N/A</description>
                  <bitRange>[31:24]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>AISR</name>
              <description>Additional Interrupt Status Register</description>
              <addressOffset>0x3C</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x1F</resetMask>
              <fields>
                <field>
                  <name>UNSPT_POLICY_IRQ</name>
                  <description>Unsupported Policy event status.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DYN_ACCEPT_IRQ</name>
                  <description>Dynamic transition acceptance event status.</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DYN_DENY_IRQ</name>
                  <description>Dynamic transition denial event status.</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>STA_POLICY_PWR_IRQ</name>
                  <description>N/A</description>
                  <bitRange>[3:3]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>STA_POLICY_OP_IRQ</name>
                  <description>N/A</description>
                  <bitRange>[4:4]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>IESR</name>
              <description>Input Edge Sensitivity Register</description>
              <addressOffset>0x40</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x3FFFFF</resetMask>
              <fields>
                <field>
                  <name>DEVACTIVE00_EDGE</name>
                  <description>DEVACTIVE 0 edge sensitivity.</description>
                  <bitRange>[1:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DEVACTIVE01_EDGE</name>
                  <description>DEVACTIVE 1 edge sensitivity.</description>
                  <bitRange>[3:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DEVACTIVE02_EDGE</name>
                  <description>DEVACTIVE 2 edge sensitivity.</description>
                  <bitRange>[5:4]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DEVACTIVE03_EDGE</name>
                  <description>N/A</description>
                  <bitRange>[7:6]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DEVACTIVE04_EDGE</name>
                  <description>N/A</description>
                  <bitRange>[9:8]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DEVACTIVE05_EDGE</name>
                  <description>N/A</description>
                  <bitRange>[11:10]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DEVACTIVE06_EDGE</name>
                  <description>N/A</description>
                  <bitRange>[13:12]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DEVACTIVE07_EDGE</name>
                  <description>N/A</description>
                  <bitRange>[15:14]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DEVACTIVE08_EDGE</name>
                  <description>N/A</description>
                  <bitRange>[17:16]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DEVACTIVE09_EDGE</name>
                  <description>N/A</description>
                  <bitRange>[19:18]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DEVACTIVE10_EDGE</name>
                  <description>N/A</description>
                  <bitRange>[21:20]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>OPSR</name>
              <description>Operating Mode Active Edge Sensitivity Register</description>
              <addressOffset>0x44</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFFFF</resetMask>
              <fields>
                <field>
                  <name>DEVACTIVE16_EDGE</name>
                  <description>N/A</description>
                  <bitRange>[1:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DEVACTIVE17_EDGE</name>
                  <description>N/A</description>
                  <bitRange>[3:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DEVACTIVE18_EDGE</name>
                  <description>N/A</description>
                  <bitRange>[5:4]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DEVACTIVE19_EDGE</name>
                  <description>N/A</description>
                  <bitRange>[7:6]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DEVACTIVE20_EDGE</name>
                  <description>N/A</description>
                  <bitRange>[9:8]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DEVACTIVE21_EDGE</name>
                  <description>N/A</description>
                  <bitRange>[11:10]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DEVACTIVE22_EDGE</name>
                  <description>N/A</description>
                  <bitRange>[13:12]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DEVACTIVE23_EDGE</name>
                  <description>N/A</description>
                  <bitRange>[15:14]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>FUNRR</name>
              <description>Functional Retention RAM Configuration Register</description>
              <addressOffset>0x50</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFF</resetMask>
              <fields>
                <field>
                  <name>FUNC_RET_RAM_CFG</name>
                  <description>N/A</description>
                  <bitRange>[7:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>FULRR</name>
              <description>Full Retention RAM Configuration Register</description>
              <addressOffset>0x54</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFF</resetMask>
              <fields>
                <field>
                  <name>FULL_RET_RAM_CFG</name>
                  <description>N/A</description>
                  <bitRange>[7:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MEMRR</name>
              <description>Memory Retention RAM Configuration Register</description>
              <addressOffset>0x58</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFF</resetMask>
              <fields>
                <field>
                  <name>MEM_RET_RAM_CFG</name>
                  <description>N/A</description>
                  <bitRange>[7:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>EDTR0</name>
              <description>Power Mode Entry Delay Register 0</description>
              <addressOffset>0x160</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>OFF_DEL</name>
                  <description>N/A</description>
                  <bitRange>[7:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>MEM_RET_DEL</name>
                  <description>N/A</description>
                  <bitRange>[15:8]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>LOGIC_RET_DEL</name>
                  <description>N/A</description>
                  <bitRange>[23:16]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FULL_RET_DEL</name>
                  <description>N/A</description>
                  <bitRange>[31:24]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>EDTR1</name>
              <description>Power Mode Entry Delay Register 1</description>
              <addressOffset>0x164</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFFFF</resetMask>
              <fields>
                <field>
                  <name>MEM_OFF_DEL</name>
                  <description>N/A</description>
                  <bitRange>[7:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FUNC_RET_DEL</name>
                  <description>N/A</description>
                  <bitRange>[15:8]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
