RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
            <register>
              <name>DCDR0</name>
              <description>Device Control Delay Configuration Register 0</description>
              <addressOffset>0x170</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFFFFFF</resetMask>
              <fields>
                <field>
                  <name>CLKEN_RST_DLY</name>
                  <description>N/A</description>
                  <bitRange>[7:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>ISO_CLKEN_DLY</name>
                  <description>N/A</description>
                  <bitRange>[15:8]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RST_HWSTAT_DLY</name>
                  <description>N/A</description>
                  <bitRange>[23:16]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>DCDR1</name>
              <description>Device Control Delay Configuration Register 1</description>
              <addressOffset>0x174</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFFFF</resetMask>
              <fields>
                <field>
                  <name>ISO_RST_DLY</name>
                  <description>N/A</description>
                  <bitRange>[7:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>CLKEN_ISO_DLY</name>
                  <description>N/A</description>
                  <bitRange>[15:8]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>IDR0</name>
              <description>PPU Identification Register 0</description>
              <addressOffset>0xFB0</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x14534501</resetValue>
              <resetMask>0x3FF7FFFF</resetMask>
              <fields>
                <field>
                  <name>DEVCHAN</name>
                  <description>No. of Device Interface Channels.
0: This is a P-Channel PPU.  Refer to PPU_IDR1.OP_ACTIVE for the number of DEVPACTIVE inputs and their meaning.
non-zero: The value is the number of Q-Channels.

The device enumeration is:
Device 0: PDCM</description>
                  <bitRange>[3:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>NUM_OPMODE</name>
                  <description>No. of operating modes supported is NUM_OPMODE + 1.</description>
                  <bitRange>[7:4]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>STA_OFF_SPT</name>
                  <description>OFF support.</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>STA_OFF_EMU_SPT</name>
                  <description>OFF_EMU support.</description>
                  <bitRange>[9:9]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>STA_MEM_RET_SPT</name>
                  <description>MEM_RET support.</description>
                  <bitRange>[10:10]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>STA_MEM_RET_EMU_SPT</name>
                  <description>MEM_RET_EMU support.</description>
                  <bitRange>[11:11]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>STA_LGC_RET_SPT</name>
                  <description>LOGIC_RET support.</description>
                  <bitRange>[12:12]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>STA_MEM_OFF_SPT</name>
                  <description>MEM_OFF support.</description>
                  <bitRange>[13:13]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>STA_FULL_RET_SPT</name>
                  <description>FULL_RET support.</description>
                  <bitRange>[14:14]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>STA_FUNC_RET_SPT</name>
                  <description>FUNC_RET support.</description>
                  <bitRange>[15:15]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>STA_ON_SPT</name>
                  <description>ON support.</description>
                  <bitRange>[16:16]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>STA_WRM_RST_SPT</name>
                  <description>WARM_RST support.  Ignore this bit.  Do not use WARM_RST.</description>
                  <bitRange>[17:17]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>STA_DBG_RECOV_SPT</name>
                  <description>DBG_RECOV support.</description>
                  <bitRange>[18:18]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DYN_OFF_SPT</name>
                  <description>Dynamic OFF support.</description>
                  <bitRange>[20:20]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DYN_OFF_EMU_SPT</name>
                  <description>Dynamic OFF_EMU support.</description>
                  <bitRange>[21:21]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DYN_MEM_RET_SPT</name>
                  <description>Dynamic MEM_RET support.</description>
                  <bitRange>[22:22]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DYN_MEM_RET_EMU_SPT</name>
                  <description>Dynamic MEM_RET_EMU support</description>
                  <bitRange>[23:23]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DYN_LGC_RET_SPT</name>
                  <description>Dynamic LOGIC_RET support.</description>
                  <bitRange>[24:24]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DYN_MEM_OFF_SPT</name>
                  <description>Dynamic MEM_OFF support.</description>
                  <bitRange>[25:25]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DYN_FULL_RET_SPT</name>
                  <description>Dynamic FULL_RET support.</description>
                  <bitRange>[26:26]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DYN_FUNC_RET_SPT</name>
                  <description>Dynamic FUNC_RET support.</description>
                  <bitRange>[27:27]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DYN_ON_SPT</name>
                  <description>Dynamic ON support.</description>
                  <bitRange>[28:28]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DYN_WRM_RST_SPT</name>
                  <description>Dynamic WARM_RST support.</description>
                  <bitRange>[29:29]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>IDR1</name>
              <description>PPU Identification Register 1</description>
              <addressOffset>0xFB4</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x1777</resetMask>
              <fields>
                <field>
                  <name>PWR_MODE_ENTRY_DEL_SPT</name>
                  <description>Power mode entry delay support.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SW_DEV_DEL_SPT</name>
                  <description>Software device delay control configuration support.</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>LOCK_SPT</name>
                  <description>Lock and the lock interrupt event are supported.</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>MEM_RET_RAM_REG</name>
                  <description>N/A</description>
                  <bitRange>[4:4]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>FULL_RET_RAM_REG</name>
                  <description>N/A</description>
                  <bitRange>[5:5]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>FUNC_RET_RAM_REG</name>
                  <description>N/A</description>
                  <bitRange>[6:6]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>STA_POLICY_PWR_IRQ_SPT</name>
                  <description>Power policy transition completion event status.</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>STA_POLICY_OP_IRQ_SPT</name>
                  <description>Operating policy transition completion event status.</description>
                  <bitRange>[9:9]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>OP_ACTIVE</name>
                  <description>N/A</description>
                  <bitRange>[10:10]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>OFF_MEM_RET_TRANS</name>
                  <description>OFF to MEM_RET direct transition.  Indicates if direct transitions from OFF to MEM_RET and from OFF_EMU to MEM_RET_EMU are supported.</description>
                  <bitRange>[12:12]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>IIDR</name>
              <description>Implementation Identification Register</description>
              <addressOffset>0xFC8</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0xB50043B</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>IMPLEMENTER</name>
                  <description>Implementer identification.  [11:8] The JEP106 continuation code of the implementer.  [7] Always 0.  [6:0] The JEP106 identity code of the implementer.  For an Arm implementation, bits [11:0] are 0x43B.</description>
                  <bitRange>[11:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>REVISION</name>
                  <description>Minor revision of the product.</description>
                  <bitRange>[15:12]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>VARIANT</name>
                  <description>Major revision of the product.</description>
                  <bitRange>[19:16]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>PRODUCT_ID</name>
                  <description>PPU part identification.</description>
                  <bitRange>[31:20]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>AIDR</name>
              <description>Architecture Identification Register</description>
              <addressOffset>0xFCC</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x11</resetValue>
              <resetMask>0xFF</resetMask>
              <fields>
                <field>
                  <name>ARCH_REV_MINOR</name>
                  <description>N/A</description>
                  <bitRange>[3:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>ARCH_REV_MAJOR</name>
                  <description>N/A</description>
                  <bitRange>[7:4]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <register>
          <name>CLK_SELECT</name>
          <description>Clock Selection for Power Mode Components</description>
          <addressOffset>0x2000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x300FF</resetMask>
          <fields>
            <field>
              <name>CLK_PWR_DIV</name>
              <description>clk_pwr is generated by dividing the CLK_PWR_MUX selection by (CLK_PWR_DIV+1).</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_PWR_MUX</name>
              <description>Selects a source for the clock used by power control components.  Note that not all products support all clock sources.  Selecting a clock source that is not supported will result in undefined behavior.  It takes four cycles of the originally selected clock to switch away from it.  Do not disable the original clock during this time.</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMO</name>
                  <description>IMO - Internal R/C Oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IHO</name>
                  <description>IHO - Internal High-speed Oscillator</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSVD</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
