RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MXS40ADCMIC0</name>
      <description>ADC</description>
      <headerStructName>MXS40ADCMIC</headerStructName>
      <baseAddress>0x40520000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADCMIC_CTRL</name>
          <description>Control the operation of the ADCMIC block including clock generation,clock selection and pdm data latching</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10542</resetValue>
          <resetMask>0x9FFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_DIV_RATIO</name>
              <description>Divide ratio to divide clk_hf to yield clk_adc to process pdm_data</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDM_DIV_RATIO</name>
              <description>Divide ratio to divide clk_hf to generate clk_pdm to receive pdm_data</description>
              <bitRange>[9:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_RESET</name>
              <description>Reset for the adc domain 
 1: Out of reset and synchronized to clk_adc 
 0: In reset</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDM_LATCH_NEG_EDGE</name>
              <description>Edge of clk_hf used to latch pdm_data 
 1: Latch on negative edge 
 0: Latch on positive edge</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDM_DATA</name>
              <description>pdm data synchronuzed to clkc_sys</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_GATE_EN</name>
              <description>Two bit clock gate control that enables the mxtk_clk_gate cells 
 Bit 0: Controls clk_hf clock gate 
 Bit 1: Controls the clk_adc_syn from the ADC block</description>
              <bitRange>[14:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDM_LATCH_DELAY</name>
              <description>Number of clk_hf cycles from edge of clk_pdm to latch the pdm_data 
 When pdm_latch_neg_edge is 0 valid values are 2 through 8 
 When pdm_latch_neg_edge is 1 valid values are 3 through 9</description>
              <bitRange>[19:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKS_ACTIVE_ADC</name>
              <description>clk sel for clk_adc - one hot encoded 
 00000 : No clocks selected - clock is gated off 
 00001 : clk_adc from local clk_divder is selected 
 00010 : Inverted clk_adc from local clk_divder is selected 
 00100 : clk_adc received from adc is used  
 01000 : Inverted clk_adc received from adc is used 
 10000 : clk_pdm_int is used as clk_adc</description>
              <bitRange>[24:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKS_ACTIVE_PDM</name>
              <description>clk sel for clk_pdm - one hot encoded but the lower 2 bits and the upper 2 bits are independent of each other
 0000 : No clocks selected - clock is gated off 
 XX01 : clk_pdm from local clk_divder is selected  for external clk_pdm 
 XX10 : Inverted clk_pdm from local clk_divder is selected  for external clk_pdm 
 01XX : clk_pdm from local clk_divder is selected  as internal clk_adc to process pdm_data 
 10XX : Inverted clk_pdm from local clk_divder is selected  as internal clk_adc to latch pdm_data</description>
              <bitRange>[28:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCMIC_EN</name>
              <description>Enables the adcmic operation
 This bit controls the pdm data being latched to begin the adcmic operation.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMIC_PAD_CTRL</name>
          <description>Control the pads in the ADCMIC block</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CLK_PDM_OE</name>
              <description>Output enable for pdm clock</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMIC_FIFO_CTRL</name>
          <description>Controls the operation of the fifo</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xE00707</resetValue>
          <resetMask>0x80FFFF3F</resetMask>
          <fields>
            <field>
              <name>PGMBLE_FULL</name>
              <description>Number of programmable words to indicate distance to fifo_full and will trigger programmable full level (afifo_pgmble_full)</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGMBLE_EMPTY</name>
              <description>Number of programmable words to indicate distance to fifo_empty and will trigger programmable empty level (afifo_pgmble_empty)</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFO_RESET</name>
              <description>[0] : fifo write reset when 0 and when 1 its out of reset
 [1] : fifo_read reset when 0 and when 1 its out of reset</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFO_STATUS</name>
              <description>Indicates fifo status of the fifo that stores pcm data. The almost empty and almost full indicates there is 1 location before being full or empty and pgmble indiates the level is half the depth of the fifo that has a total depth of 64. 
 fifo_status[7] = afifo_empty              
 fifo_status[6] = afifo_almost_empty
 fifo_status[5] = afifo_pgmble_empty
 fifo_status[4] = afifo_underflow
 fifo_status[3] = afifo_full
 fifo_status[2] = afifo_almost_full
 fifo_status[1] = afifo_pgmble_full
 fifo_status[0] = afifo_overflow</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFO_WR_BYPASS</name>
              <description>This is a bit set for debug where the data written into the fifo comes from the lfsr register</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMIC_LFSR_CTRL</name>
          <description>Controls the operation of the LFSR</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80622EE0</resetValue>
          <resetMask>0xFFFFBFFF</resetMask>
          <fields>
            <field>
              <name>LFSR_EN</name>
              <description>Write a 1 to this bit to begin the lfsr operation</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LFSR_SET</name>
              <description>When this bit is 1 then the lfsr register resets to 32'hFFFFFFFF</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LFSR_MODE</name>
              <description>N/A</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LFSR_VALID_CNTR_LIMIT</name>
              <description>The valid pulse for the lfsr_data dictates validity on a cycle basis. By default there is a new pattern every 750(0x2EE) cycles</description>
              <bitRange>[13:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LFSR_CLR</name>
              <description>When this bit is 1 then the lfsr register resets to 32'h00000000</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LFSR_TAPS</name>
              <description>This field provides the tap points for the LFSR wuth lfsr_taps[15:8] corresponds to tap points [31:24] of the lfsr register while lfsr_taps[7:0] corresponds to tap points [7:0] of the lfsr register.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMIC_TRIGGER</name>
          <description>Register to control Trigger</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>TR_DC</name>
              <description>Trigger when timer fires for DC measurement</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TR_DATA</name>
              <description>Trigger when output fifo has valid data</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMIC_TRIGGER_CLR</name>
          <description>Register to clear Trigger</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>TR_DC</name>
              <description>Activate functionality:
0: No effect.
1: Bit is set to 0.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TR_DATA</name>
              <description>Activate functionality:
0: No effect.
1: Bit is set to 0.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMIC_TRIGGER_SET</name>
          <description>Register to set Trigger</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>TR_DC</name>
              <description>Activate functionality:
0: No effect.
1: Bit is set to 1.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TR_DATA</name>
              <description>Activate functionality:
0: No effect.
1: Bit is set to 1.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMIC_TRIGGER_MASK</name>
          <description>Register to mask Trigger</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>TR_DC</name>
              <description>Mask for corresponding field in ADCMIC_TRIGGER register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TR_DATA</name>
              <description>Mask for corresponding field in ADCMIC_TRIGGER register.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMIC_INTR</name>
          <description>Register to cause Interrupt</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>INTERRUPT_DC</name>
              <description>HW sets this field to 1, when dc measurement is done.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERRUPT_DATA</name>
              <description>HW sets this field to 1, when fifo has valid data</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMIC_INTR_SET</name>
          <description>Register to set Interrupt</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>INTERRUPT_DC</name>
              <description>Write this field with '1' to set corresponding ADCMIC_INTR field (a write of '0' has no effect).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERRUPT_DATA</name>
              <description>Write this field with '1' to set corresponding ADCMIC_INTR field (a write of '0' has no effect).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMIC_INTR_MASK</name>
          <description>Register to mask Interrupt</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>INTERRUPT_DC</name>
              <description>Mask for corresponding field in ADCMIC_INTR register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERRUPT_DATA</name>
              <description>Mask for corresponding field in ADCMIC_INTR register.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMIC_INTR_MASKED</name>
          <description>Register to and intr_mask Intr to crreate the interrupt</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>INTERRUPT_DC</name>
              <description>Logical AND of corresponding ADCMIC_INTR and ADCMIC_INTR_MASK fields.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTERRUPT_DATA</name>
              <description>Logical AND of corresponding ADCMIC_INTR and ADCMIC_INTR_MASK fields.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMIC_TRIG_INTRPT_TIMER_CTRL</name>
          <description>Controls the timer for the generation of triggers and interrupts for dc measurement in the block</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000960</resetValue>
          <resetMask>0xC000FFFF</resetMask>
          <fields>
            <field>
              <name>TIMER_LIMIT</name>
              <description>At 96Mhz this count will generate interrupt to indicate that 25us has lapsed and the ADC core digital voltage is valid.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_CLR</name>
              <description>When high clk_timer is cleared</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_INC</name>
              <description>Enable the timer to begin counting on every clk_sys cycle to timer_limit and then generate the interrupt. 
 1: Counts up every clk_sys cycle 
 0: Counts when cic is updated</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMIC_TP</name>
          <description>Data used for DFT test for setting and observing test points</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF00FF</resetMask>
          <fields>
            <field>
              <name>TEST_POINT_SET_DATA</name>
              <description>Bits to control tests points</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_POINT_OBSERVE_DATA</name>
              <description>Bits to observe tests points</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMIC_DATA</name>
          <description>N/A</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FIFO_DATA</name>
              <description>Data from the FIFO</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_CLK_CTRL</name>
          <description>Control the clocks in the ADC block</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x39</resetMask>
          <fields>
            <field>
              <name>ADC_SYN_CLK_PHASE</name>
              <description>Output synchronization clock phase control
 0: non-inverted clock phase 
 1: inverted clock phase</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_CLK_GATE_EN</name>
              <description>Clock gate control to enable the clock to ADC
 0: Clock is Disabled  
 1: Clock is Enabled</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DATA_OUT</name>
              <description>Two bit PDM data from ADC that is latched
 3-level ADC data outputs:
 11 High
 01 Mid
 00 Low</description>
              <bitRange>[5:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_GPIO_CTRL</name>
          <description>GPIO control for ADC</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>ADC_DCIN_MUX</name>
              <description>ADC DC input selection (32-to-1 MUX):
 01111 ADC reference ground (ADC_REFGND)
 01110 ADC BG REF (ADC_BGREF)
 01101 Core supply (VDDC)
 01100 Battery/IO supply (VBAT/VDDIO)
 01011 GPIO 27 
 01010 GPIO 26 
 01001 GPIO 25 
 01000 GPIO 24 
 00111 GPIO 23 
 00110 GPIO 22 
 00101 GPIO 21 
 00100 GPIO 20 
 00011 GPIO 19 
 00010 GPIO 18 
 00001 GPIO 17 
 00000 GPIO 16 
 11111 GPIO 15 
 11110 GPIO 14 
 11101 GPIO 13 
 11100 GPIO 12 
 11011 GPIO 11 
 11010 GPIO 10 
 11001 GPIO 9  
 11000 GPIO 8  
 10111 GPIO 7  
 10110 GPIO 6  
 10101 GPIO 5  
 10100 GPIO 4  
 10011 GPIO 3  
 10010 GPIO 2  
 10001 GPIO 1  
 10000 GPIO 0</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
