RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
        <register>
          <name>ADC_PD_CTRL</name>
          <description>Control the  power down controls in the ADC block.</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>ADC_EN_VBAT</name>
              <description>ADC IP level enable control from avddBAT supply domain:
 0: power down all the blocks supplied by VBAT when the 
 core supply is not ready 
 1: ADC power up/down controlled by 1.2V power up/down signals 
 Enable control signal in 1.6V-3.6V avddBAT supply domain</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_PWRUP</name>
              <description>ADC IP level main power up/down control: 
 0: power down whole ADC IP (Default)
 1: power up</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_REF_PWRUP</name>
              <description>ADC BG &amp; REF power up/down:
 0: power down BG and REF (Default)
 1: power up</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_CORE_PWRUP</name>
              <description>ADC core power up/down:
 0: power down ADC Core (Default)
 1: power up</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIC_PWRUP</name>
              <description>ADC MIC (Audio) path power up/down control:
 0: power down MIC bias and PGA (Default)
 1: power up</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIC_CLAMP_EN</name>
              <description>MIC PGA clamping enable/disable:
 0: disable MIC PGA clamping (Default)
 1: enable MIC PGA clamping</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MICBIAS_PWRUP</name>
              <description>MIC bias power up/down:
 0: power down MIC Bias(Default)
 1: Power up</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_MODE</name>
              <description>MIC (Audio) input and DC measurement input selection:
 0 ADC in DC Measurement Mode;
 DC measurement path enabled;
 MIC path powered down
 1 ADC in Audio application Mode;
 MIC path enabled. DC input is gated</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_MIC_PDSLT</name>
              <description>MIC path power up/down control selection in DC measurement mode:
 0: Power down MIC Bias and PGA in DC measurement Mode
 1: MIC path power up/down controlled by its pwrdn signal</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IDDQ</name>
              <description>Chip global power down control:
 0: power up (Default)
 1: power down</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_BG_REF_CTRL</name>
          <description>Control the Band Gap and Reference Voltages of the ADC</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FFFF</resetMask>
          <fields>
            <field>
              <name>ADC_BG_PTAT_CTRL</name>
              <description>BG PTAT current adjustment:
 011  3.62 percent
 010  2.32 percent
 001  1.11 percent
 000  0.00 percent
 111 -1.11 percent
 110 -2.17 percent
 101 -3.19 percent
 100 -4.10 percent</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_BG_CTAT_CTRL</name>
              <description>BG CTAT current adjustment:
 011  3.02 percent
 010  1.92 percent
 001  0.92 percent
 000  0.00 percent
 111 -0.93 percent
 110 -1.82 percent
 101 -2.68 percent
 100 -3.51 percent</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_REF_CTRL</name>
              <description>ADC reference voltage programmability:
 [3:0] Vref(mV)
 0000 850.0
 0001 856.1
 0010 862.1
 0011 868.2
 0100 874.3
 0101 880.4
 0110 886.4
 0111 892.5
 1000 801.4
 1001 807.5
 1010 813.6
 1011 819.6
 1100 825.7
 1101 831.8
 1110 837.9
 1111 843.9</description>
              <bitRange>[9:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SCF_CLKDIV</name>
              <description>Switch cap filter clock frequency selection:
 00: 50KHz (default)
 01: 25KHz
 10: 100KHz
 11: 1.6MHz</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SCF_BYPASS</name>
              <description>BG REF switch cap filter bypass
 0: enable switch cap filter
 1: bypass switch cap filter</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SCF_BYPASS_SEQ</name>
              <description>External power up sequence for BG SCF bypass</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SCF_SEQ_SLT</name>
              <description>Internal/External BG SCF power up sequence selection:
 0: use internal power up sequence
 1: use external power up sequence</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_BIAS_CTRL</name>
              <description>Global bias current programmability
 10: 3.0uA
 11: 2.5uA
 00: 2.5uA
 01: 2.0uA</description>
              <bitRange>[16:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_CORE_CTRL</name>
          <description>Control the clocks in the ADC block</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>ADC_DITH_CTRL</name>
              <description>Dither Sequence control
 00: No dither
 01: prbs15
 10: prbs23
 11: prbs31</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_SHUFF_EN</name>
              <description>Disable the shuffler:
 0: disabled
 1: enabled</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_RESET_EN</name>
              <description>Disable reset function in DC measurement:
 0: disabled
 1: enabled</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DCINPUT_RANGE</name>
              <description>ADC input range selection for DC measurement path:
 0: 0-3.6V
 1: 0-1.8V</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_CLK_DIV2</name>
              <description>ADC internal clock division:
 0: disable divide-by-2; ADC sampling clock at 12MHz
 1: enable divide-by-2; ADC sampling clock at 6MHz</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_MIC_BIAS_PGA_CTRL</name>
          <description>Control the BIAS and PGA of ADC block</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>MIC_BIAS_REF_CTRL</name>
              <description>MIC bias reference voltage programmability:
 00: 75 percent of Audio Supply (default)
 10: 80 percent of Audio Supply
 01 / 11: 70 percent of Audio Supply</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIC_BIAS_CTRL</name>
              <description>MIC bias output voltage programmability:
 00: 1.12 X Reference Voltage (default)
 01: 1.14 X Reference voltage
 10: 1.17 X Reference voltage
 11: 1.10 X Reference voltage</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIC_REF_SLT</name>
              <description>MIC bias reference selection:
 0: supply as MIC bias reference. MIC bias output voltage
 scaled with supply voltage
 1: BG voltage as MIC bias reference to have constant MIC
 bias output voltage</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIC_SCF_CLK_CTRL</name>
              <description>MIC bias reference filter clock programmability:
 00: 50KHz (default)
 01: 25KHz
 10: 100KHz
 11: 1.6MHz</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIC_SCF_BYPASS</name>
              <description>MIC bias switch cap filter bypass
 0: enable switch cap filter
 1: bypass switch cap filter</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIC_SCF_BYPASS_SEQ</name>
              <description>External power up sequence for MIC bias SCF bypass</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIC_SCF_SEQ_SLT</name>
              <description>Internal/External MIC bias SCF power up sequence selection:
 0: use internal power up sequence
 1: use external power up sequence</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIC_BIAS_LZ</name>
              <description>MIC bias low/high output impedance control during power down mode:
 0: MIC bias output is HZ in power down mode (default)
 1: MIC bias output is LZ in power down mode</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIC_PGA_GAIN_CTRL</name>
              <description>MIC PGA gain control: 1dB steps
 000000 : 0  dB
 000001 : 1  dB
 000010 : 2  dB
 000011 : 3  dB
 000100 : 4  dB
 000101 : 5  dB
 000110 : 6  dB
 000111 : 7  dB
 001000 : 8  dB
 001001 : 9  dB
 001010 : 10 dB
 001011 : 11 dB
 001100 : 12 dB
 001101 : 13 dB
 001110 : 14 dB
 001111 : 15 dB
 010000 : 16 dB
 010001 : 17 dB
 010010 : 18 dB
 010011 : 19 dB
 010100 : 20 dB
 010101 : 21 dB
 010110 : 22 dB
 010111 : 23 dB
 011000 : 24 dB
 011001 : 25 dB
 011010 : 26 dB
 011011 : 27 dB
 011100 : 28 dB
 011101 : 29 dB
 011110 : 30 dB
 011111 : 31 dB
 100000 : 32 dB
 100001 : 33 dB
 100010 : 34 dB
 100011 : 35 dB
 100100 : 36 dB
 100101 : 37 dB
 100110 : 38 dB
 100111 : 39 dB
 101000 : 40 dB
 101001 : 41 dB
 101010 : 42 dB</description>
              <bitRange>[16:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIC_PGA_INCM_CTRL</name>
              <description>PGA input common mode control 01 : 0.45 * avdd 00 : 0.4 * avdd 10 : 0.35 * avdd</description>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIC_PGA_OUTCM_CTRL</name>
              <description>PGA output common mode control
 01 : 0.7
 00 : 0.6
 10 : 0.5</description>
              <bitRange>[20:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIC_PGA_CLAMPVREF_CTRL</name>
              <description>PGA clamp threshold voltage control
 01 : 0.92  V
 00 : 0.95  V
 10 : 0.975 V
 11 : 1     V</description>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIC_NEG_INPUT_SLT</name>
              <description>N/A</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_SPARE</name>
          <description>Spare registers in the ADC block</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>ADC_SPARE</name>
              <description>Spare Bits
 adc_spare[7] External reset of ADC
 0: Disabled
 1: Enabled</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_CTRL</name>
          <description>Register to control AuxAdcDecim operation</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4300</resetValue>
          <resetMask>0xFF7D</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable for the aux_adc block</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DF3_BYPASS</name>
              <description>Bypass df3 FIR completely</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BIQUAD_BYPASS</name>
              <description>Bypass biquad completely</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DFMODE</name>
              <description>Mode of Operation 
 0 : DC mode, 480kHz, fast:   with DC convergence time of 10^-6 seconds 
 1 : DC mode, 480kHz, medium: with DC convergence time of 15^-6 seconds 
 2 : DC mode, 480kHz, slow:   with DC convergence time of 20^-6 seconds 
 3 : Audio mode, 16kHz, analog mic 
 4 : Audio mode, 16kHz, digital mic 
 5 : Audio mode, 8kHz, analog mic 
 6 : Audio mode, 8kHz, digital mic</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MPR0</name>
              <description>Mapping bits mpr0 that maps to ADC data 00 or PDM data 0</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MPR1</name>
              <description>Mapping bits mpr1 that maps to ADC data 01</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MPR2</name>
              <description>Mapping bits mpr2 that maps to ADC data 10</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MPR3</name>
              <description>Mapping bits mpr3 that maps to ADC data 11 or PDM data 1</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_CIC_CTRL</name>
          <description>Register to control CIC operation in AuxAdcDecim block</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CIC_GAIN</name>
              <description>CIC gain value that will be used only during override. This will be used only when AUXADC_OVERRIDE[22] is set</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_OVERRIDE</name>
          <description>Register that holds the override values for AuxAdcDecim block</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FFFFF</resetMask>
          <fields>
            <field>
              <name>OVERRIDE</name>
              <description>Override Values for Auxadc. When override[22] is set then the remaining buts will override the default values within the matlab model generated RTL code 
 Bit  22    When set the values below are used to configure the auxAdcDecim block otherwise it defaults to the default values within the matlab generated code
 The cic gain is picked from the AUXADC_CIC_CTRL register when this is set. In the matlab model this is based on dfmode as follows: 
 dfmode 000     : 16'h68DC 
 dfmode 001     : 16'h8638 
 dfmode 010     : 16'h2CBD 
 dfmode 011     : 16'hD1B7 
 dfmode 100     : 16'h51EC 
 dfmode 101     : 16'h346E 
 dfmode default : 16'hA3D7 
 Bits 21:16 Sets up counters for various modes of operation - In the matlab model this is based on dfmode as follows: 
 dfmode 000     : 6'b000100 
 dfmode 001     : 6'b000100 
 dfmode 010     : 6'b000100 
 dfmode 011     : 6'b000100 
 dfmode 100     : 6'b000100 
 dfmode 101     : 6'b001001 
 dfmode default : 6'b001001 
 Bits 15:13 Sets up counters for CIC integrator to sample input - is a constant 3'b100 in the matlab model and is used when pdm is not enabled 
 Bits 12:10 The gain in the CIC integrator. In the matlab model this is based on dfmode as follows: 
 dfmode 000     : 3'b011 
 dfmode 001     : 3'b101 
 dfmode 010     : 3'b101 
 dfmode 011     : 3'b011 
 dfmode 100     : 3'b001 
 dfmode 101     : 3'b011 
 dfmode default : 3'b010 
 Bits 09    Used for enabling pdm mode. In the matlab model this is set to 1 if dfmode is 4 or 6 and is the select of a mux that selects the pulse to sample pdm data.  
 Bits 08    This bit when set bypasses the 3rd stage of the integration in CIC. In the matlab model this is based on dfmode as follows: 
 dfmode 000     : 1'b1 
 dfmode 001     : 1'b0 
 dfmode 010     : 1'b0 
 dfmode 011     : 1'b1 
 dfmode 100     : 1'b1 
 dfmode 101     : 1'b1 
 dfmode default : 1'b1 
 Bits 07:06 The delay in the first stage of CIC differntiator. In the matlab model this is based on dfmode as follows: 
 dfmode 000     : 2'b01 
 dfmode 001     : 2'b01 
 dfmode 010     : 2'b11 
 dfmode 011     : 2'b00 
 dfmode 100     : 2'b00 
 dfmode 101     : 2'b00 
 dfmode default : 2'b00 
 Bits 05:04 The delay in the second stage of CIC differntiator. In the matlab model this is based on dfmode as follows: 
 dfmode 000     : 2'b00 
 dfmode 001     : 2'b01 
 dfmode 010     : 2'b10 
 dfmode 011     : 2'b00 
 dfmode 100     : 2'b00 
 dfmode 101     : 2'b00 
 dfmode default : 2'b00 
 Bits 03    The delay in the third stage of CIC differntiator. In the matlab model this is constant 0 irrespective of dfmode 
 Bits 02:0  Enables various filters in the design.
 If the value is &gt;=1 then df1 is enabled
 if &gt;=2 then df2 is enabled
 if &gt;=3 then df3 is enabled
 if &gt;=4 then biquad is enabled. 
 In the matlab model this is based on dfmode as follows: 
 dfmode 000     : 3'b000 
 dfmode 001     : 3'b000 
 dfmode 010     : 3'b000 
 dfmode 011     : 3'b100 
 dfmode 100     : 3'b100 
 dfmode 101     : 3'b100 
 dfmode default : 3'b100</description>
              <bitRange>[22:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_DF3_COEFF</name>
          <description>Register that controls the RAM operation for writing DF3 Coefficients into the RAM</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xFFFF81F7</resetMask>
          <fields>
            <field>
              <name>DF3_COEFF_SEL</name>
              <description>Sel for selecting Coefficient of df3 from the ram during the filtering at this stage</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DF3_COEFF_PGM_EN</name>
              <description>Enable this bit before the df3_coeff ram can be programmed</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DF3_COEFF_WREN</name>
              <description>Write Enable for writing Coefficient of df3</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DF3_COEFF_ADDR</name>
              <description>Address for writing Coefficient of df3</description>
              <bitRange>[8:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DF3_ACCESS_DONE</name>
              <description>Hardware sets this bit when the operation is done while software clears this bit to start operation</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DF3_COEFF_DATA</name>
              <description>Data for writing Coefficient of df3 during the write cycle and read data during the read cycle</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
