RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
        <register>
          <name>AUXADC_BIQUAD0_COEFF_0</name>
          <description>Register holding the coefficients for BIQUAD0 operation.</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x81B23F27</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BQ0_NUM1_COEFF</name>
              <description>Coefficient for biquad0_num1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BQ0_NUM2_COEFF</name>
              <description>Coefficient for biquad0_num2</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_BIQUAD0_COEFF_1</name>
          <description>Register holding the coefficients for BIQUAD0 operation.</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F27</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BQ0_NUM3_COEFF</name>
              <description>Coefficient for biquad0_num1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_BIQUAD0_COEFF_2</name>
          <description>Register holding the coefficients for BIQUAD0 operation.</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3E5181B5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BQ0_DEN2_COEFF</name>
              <description>Coefficient for biquad0_num1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BQ0_DEN3_COEFF</name>
              <description>Coefficient for biquad0_num2</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_BIQUAD1_COEFF_0</name>
          <description>Register holding the coefficients for BIQUAD1 operation.</description>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4CCF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BQ1_NUM1_COEFF</name>
              <description>Coefficient for biquad1_num1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BQ1_NUM2_COEFF</name>
              <description>Coefficient for biquad1_num2</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_BIQUAD1_COEFF_1</name>
          <description>Register holding the coefficients for BIQUAD1 operation.</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BQ1_NUM3_COEFF</name>
              <description>Coefficient for biquad1_num1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_BIQUAD1_COEFF_2</name>
          <description>Register holding the coefficients for BIQUAD1 operation.</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BQ1_DEN2_COEFF</name>
              <description>Coefficient for biquad1_num1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BQ1_DEN3_COEFF</name>
              <description>Coefficient for biquad1_num2</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_BIQUAD2_COEFF_0</name>
          <description>Register holding the coefficients for BIQUAD2 operation.</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BQ2_NUM1_COEFF</name>
              <description>Coefficient for biquad2_num1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BQ2_NUM2_COEFF</name>
              <description>Coefficient for biquad2_num2</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_BIQUAD2_COEFF_1</name>
          <description>Register holding the coefficients for BIQUAD2 operation.</description>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BQ2_NUM3_COEFF</name>
              <description>Coefficient for biquad2_num1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_BIQUAD2_COEFF_2</name>
          <description>Register holding the coefficients for BIQUAD2 operation.</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BQ2_DEN2_COEFF</name>
              <description>Coefficient for biquad2_num1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BQ2_DEN3_COEFF</name>
              <description>Coefficient for biquad2_num2</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_BIQUAD3_COEFF_0</name>
          <description>Register holding the coefficients for BIQUAD3 operation.</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BQ3_NUM1_COEFF</name>
              <description>Coefficient for biquad3_num1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BQ3_NUM2_COEFF</name>
              <description>Coefficient for biquad3_num2</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_BIQUAD3_COEFF_1</name>
          <description>Register holding the coefficients for BIQUAD3 operation.</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BQ3_NUM3_COEFF</name>
              <description>'Coefficient for biquad3_num1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_BIQUAD3_COEFF_2</name>
          <description>Register holding the coefficients for BIQUAD3 operation.</description>
          <addressOffset>0x23C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BQ3_DEN2_COEFF</name>
              <description>Coefficient for biquad3_num1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BQ3_DEN3_COEFF</name>
              <description>Coefficient for biquad3_num2</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_BIQUAD4_COEFF_0</name>
          <description>Register holding the coefficients for BIQUAD4 operation.</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BQ4_NUM1_COEFF</name>
              <description>Coefficient for biquad4_num1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BQ4_NUM2_COEFF</name>
              <description>Coefficient for biquad4_num2</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_BIQUAD4_COEFF_1</name>
          <description>Register holding the coefficients for BIQUAD4 operation.</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BQ4_NUM3_COEFF</name>
              <description>Coefficient for biquad4_num1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_BIQUAD4_COEFF_2</name>
          <description>Register holding the coefficients for BIQUAD4 operation.</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BQ4_DEN2_COEFF</name>
              <description>Coefficient for biquad4_num1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BQ4_DEN3_COEFF</name>
              <description>Coefficient for biquad4_num2</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_CIC_STATUS</name>
          <description>Status of the CIC in AuxAdcDecim block</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x10000</resetMask>
          <fields>
            <field>
              <name>CIC</name>
              <description>Computed cic value</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LATCH_ON_TIMER</name>
              <description>Latches continously by default but when set to 1 it latches on timer</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_DF1_STATUS</name>
          <description>Status of the DF1 FIR Filter in AuxAdcDecim block</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DF1</name>
              <description>Computed df1 value</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_DF2_STATUS</name>
          <description>Status of the DF2 FIR Filter in AuxAdcDecim block</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DF2</name>
              <description>Computed df2 value</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_DF3_STATUS</name>
          <description>Status of the DF3 FIR Filter in AuxAdcDecim block</description>
          <addressOffset>0x25C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DF3</name>
              <description>Computed df3 value</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXADC_BIQUAD_STATUS</name>
          <description>Status of the BIQUAD IIR  Filter in AuxAdcDecim block</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>BQ</name>
              <description>Computed bq value</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
