RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
        <cluster>
          <dim>2</dim>
          <dimIncrement>128</dimIncrement>
          <name>DEVICE[%s]</name>
          <description>Device (only used for XIP acceses)</description>
          <addressOffset>0x00000800</addressOffset>
          <register>
            <name>CTL</name>
            <description>Control</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFF311</resetMask>
            <fields>
              <field>
                <name>WR_EN</name>
                <description>Write enable:
'0': write transfers are not allowed to this device. An attempt to write to this device results in an AHB-Lite bus error.
'1': write transfers are allowed to this device.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CRYPTO_EN</name>
                <description>Cryptography on read/write accesses:
'0': disabled.
'1': enabled.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_SEL</name>
                <description>Specifies the connection of the IP's data lines (spi_data[0], ..., spi_data[7]) to the device's data lines (SI/IO0, SO/IO1, IO2, IO3, IO4, IO5, IO6, IO7):
'0': spi_data[0] = IO0, spi_data[1] = IO1, ..., spi_data[7] = IO7. This value is allowed for single, dual, quad, dual quad and octal SPI modes. This value must be used for the first device in dual quad SPI mode. This value must be used for octal SPI mode.
'1': spi_data[2] = IO0, spi_data[3] = IO1. This value is only allowed for single and dual SPI modes.
'2': spi_data[4] = IO0, spi_data[5] = IO1, ..., spi_data[7] = IO3. This value is only allowed for single, dual, quad and dual quad  SPI modes. In dual quad SPI mode, this value must be used for the second device. 
'3': spi_data[6] = IO0, spi_data[7] = IO1. This value is only allowed for single and dual SPI modes.</description>
                <bitRange>[9:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MERGE_TIMEOUT</name>
                <description>Continuous transfer merge timeout in clk_mem cycles. This limits the standby time of the memory interface, i.e. the time the memory device is selected but no data is transferred.
The counting of the merge timeout period is done in the XIP block using clk_mem cycles. It starts when the last TX or RX byte is transferred to or from the data FIFOs.
After this period the memory device is deselected. A later transfer, even from a continuous address, starts with the overhead phases (command, address, mode, dummy cycles).</description>
                <bitRange>[14:12]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>_1_cycle</name>
                    <description>Timeout after 1 clk_mem cycle. 
That means transfers will only be merged if the continuous transfer request is already available when the previous transfer is finished.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>_16_cycles</name>
                    <description>Timeout after 2^4 = 16 clk_mem cycles. 
At a clk_mem frequency of 200MHz this means 80ns.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>_256_cycles</name>
                    <description>Timeout after 2^8 = 256 clk_mem cycles. 
At a clk_mem frequency of 200MHz this means ~1.3us.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>_4096_cycles</name>
                    <description>Timeout after 2^12 = 4096 clk_mem cycles. 
At a clk_mem frequency of 200MHz this means ~20us.</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>_65536_cycles</name>
                    <description>Timeout after 2^16 = 65536 clk_mem cycles. 
At a clk_mem frequency of 200MHz this means ~330us.</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RSVD5</name>
                    <description>N/A</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RSVD6</name>
                    <description>N/A</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RSVD7</name>
                    <description>N/A</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MERGE_EN</name>
                <description>Continous transfer merge enable:
'0': Disabled. No merging of transfers is done. Longest possible memory transfer is 16 Byte.
'1': Enabled. Merging of continous transfers is done. This skips the overhead (command, address, mode, dummy cycles) for a continuous (linear sequential) transfer.</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TOTAL_TIMEOUT</name>
                <description>Total transfer timeout in clk_mem cycles.
The counting of the total timout period is done in the XIP block using clk_mem cycles. It starts when the first command of a new (not merged) transaction is transferred to the TX command FIFO causing the interface logic to select the memory.
After this period the memory device is deselected.

