RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TDM0</name>
      <description>TDM</description>
      <headerStructName>TDM</headerStructName>
      <baseAddress>0x408C0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <name>TDM_STRUCT</name>
          <description>TDM structure</description>
          <addressOffset>0x00008000</addressOffset>
          <cluster>
            <name>TDM_TX_STRUCT</name>
            <description>TDM TX structure</description>
            <addressOffset>0x00000000</addressOffset>
            <register>
              <name>TX_CTL</name>
              <description>TX control</description>
              <addressOffset>0x0</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x10000</resetValue>
              <resetMask>0x8001300F</resetMask>
              <fields>
                <field>
                  <name>WORD_SIZE</name>
                  <description>PCM word size:
'0': 8 bit.
'1': 10 bit.
'2': 12 bit.
'3': 14 bit.
'4': 16 bit.
'5': 18 bit.
'6': 20 bit.
'7': 24 bit.
'8': 32 bit.
'9'-'15': Undefined.</description>
                  <bitRange>[3:0]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SIZE_8</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_10</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_12</name>
                      <description>N/A</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_14</name>
                      <description>N/A</description>
                      <value>3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_16</name>
                      <description>N/A</description>
                      <value>4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_18</name>
                      <description>N/A</description>
                      <value>5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_20</name>
                      <description>N/A</description>
                      <value>6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_24</name>
                      <description>N/A</description>
                      <value>7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_32</name>
                      <description>N/A</description>
                      <value>8</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>FORMAT</name>
                  <description>Format:
'0': Left-aligned delayed.
'1': Left-aligned.
'2': Right-aligned delayed.
'3': Right-aligned.</description>
                  <bitRange>[13:12]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>LEFT_DELAYED</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>LEFT</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RIGHT_DELAYED</name>
                      <description>N/A</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RIGHT</name>
                      <description>N/A</description>
                      <value>3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MS</name>
                  <description>Master/slave setting:
'0': Slave.
- External transmitter 'tdm_tx_sck_in' and transmitter 'tdm_tx_fsync_in'.
'1': Master.
- Interface clock 'clk_if' is used to generate transmitter 'tdm_tx_sck_out' and transmitter 'tdm_tx_fsync_out'.</description>
                  <bitRange>[16:16]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SLAVE</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MASTER</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ENABLED</name>
                  <description>Transmitter (TX) enable:
'0': Disabled. All non-retained MMIO registers (e.g. the TX_FIFO_STATUS and INTR_TX registers) have their fields reset to their default value.
'1': Enabled.

Note: when all transmitters and receivers are disabled, the SRAMs are driven into low power mode, if supported by the SRAM. When exiting such low power mode software needs to allow for a certain power up time before SRAM can be used, i.e. before ACTIVE can be asserted. The power up time is equivalent to the system SRAM power up time specified in the CPUSS.RAM_PWR_DELAY_CTL register (or equivalent for platforms other than MXS40).</description>
                  <bitRange>[31:31]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>TX_IF_CTL</name>
              <description>TX interface control</description>
              <addressOffset>0x10</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x1F018707</resetValue>
              <resetMask>0x9F1FB7FF</resetMask>
              <fields>
                <field>
                  <name>CLOCK_DIV</name>
                  <description>Interface clock divider (legal range [1, 255]). The TDM interface 'tdm_tx_sck_out' output signal is defined as clk_if / (CLOCK_DIV + 1). CLOCK_DIV should be set to an odd value ({1, 3, 5, ..., 255}), to ensure a 50/50 percent duty cycle  clock.

Note: Used in master configuration only.</description>
                  <bitRange>[7:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CLOCK_SEL</name>
                  <description>Interface clock 'clk_if' selection:
'0': SRSS clock clk_if_srss[0].
'1': SRSS clock clk_if_srss[1].
'2': SRSS clock clk_if_srss[2].
'3': SRSS clock clk_if_srss[3].
'4': Master interface clock 'tdm_tx_mck_in'.
'5'-'7': undefined.

Note: the application is always required to program this field to a value different from the default.</description>
                  <bitRange>[10:8]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SEL_SRSS_CLOCK0</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SEL_SRSS_CLOCK1</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SEL_SRSS_CLOCK2</name>
                      <description>N/A</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SEL_SRSS_CLOCK3</name>
                      <description>N/A</description>
                      <value>3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SEL_TDM_TX_MCK_IN</name>
                      <description>N/A</description>
                      <value>4</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SCK_POLARITY</name>
                  <description>Clock polarity:
'0': Clock signal is used 'as is'.
'1': Clock signal is inverted.

Note: Used in BOTH master and slave configurations.</description>
                  <bitRange>[12:12]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FSYNC_POLARITY</name>
                  <description>Channel synchronization polarity:
'0': Channel synchronization signal is used 'as is'.
'1': Channel synchronization signal is inverted.

Note: Used in BOTH master and slave configurations.</description>
                  <bitRange>[13:13]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FSYNC_FORMAT</name>
                  <description>Channel synchronization pulse format:
'0': Duration of a single bit period.
'1': Duration of the first channel.</description>
                  <bitRange>[15:15]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>BIT_PERIOD</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CH_PERIOD</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_NR</name>
                  <description>Number of channels in the frame:
'0': Undefined/illegal.
'1': 2 channels.
'2': 3 channels.
...
'31': 32 channels.

Note: the field value chould be less than CH_NR (the number of support channels).

Note: the TX_CH_CTL.CH_EN fields can be used to enable/disable indvidual channels.</description>
                  <bitRange>[20:16]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CH_SIZE</name>
                  <description>Channel size:
'0'-'2': Undefined/illegal.
'3': 4 bits.
...
'31': 32 bits.

Note: if TX_CTL.WORD_SIZE is greater than CH_SIZE, the more significant bits of the word are transmitted and the lesser significant bits of the word are dropped.</description>
                  <bitRange>[28:24]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SIZE_1</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_2</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_32</name>
                      <description>N/A</description>
                      <value>31</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>I2S_MODE</name>
                  <description>I2S mode setting:
'0': TDM mode.
'1': I2S mode.</description>
                  <bitRange>[31:31]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TDM</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>I2S</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>TX_CH_CTL</name>
              <description>TX channel control</description>
              <addressOffset>0x14</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>CH_EN</name>
                  <description>Channel enables: channel i is controlled by CH_EN[i].
'0': Disabled. The TX FIFO does not produce channel i words and the transmitted channel i words on the interface are not driven (the output enable of the 'tdm_tx_sd_out' output signal is not driven).
'1': Enabled.

Note: Only bit 0 through TX_IF_CTL.CH_NR may be set to '1'; i.e. only channels that are present in the frame can be enabled.</description>
                  <bitRange>[31:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>TX_TEST_CTL</name>
              <description>TX test control</description>
              <addressOffset>0x20</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x80000000</resetMask>
              <fields>
                <field>
                  <name>ENABLED</name>
                  <description>Test mode enable.
'0': Disabled. Functional mode.
- Transmitter tx_sck_in = IOSS tdm_tx_sck_in.
- Transmitter tx_fsync_in = IOSS tdm_tx_fsync_in.
- Receiver rx_sd_in = IOSS tdm_rx_sd_in.
'1': Enabled. Test mode (intended to be used with (slave transmitter, master receiver) configuration).
- Transmitter tx_sck_in = Receiver tdm_rx_sck_out.
- Transmitter tx_fsync_in = Receiver tdm_rx_fsync_out.
- Receiver rx_sd_in = Transmitter tdm_tx_sd_out.

Note: TX_TEST_CTL.ENABLED and RX_TEST_CTL.ENABLED should not be set to '1' simultaneously.</description>
                  <bitRange>[31:31]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FUNCTIONAL</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TEST</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>TX_ROUTE_CTL</name>
              <description>TX route control</description>
              <addressOffset>0x24</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x3</resetMask>
              <fields>
                <field>
                  <name>MODE</name>
                  <description>Controls routing to the TX slave signalling inputs (FSYNC/SCK):
'0': TX slave signaling indipendent from RX signaling:
- Transmitter tx_sck_in = IOSS tdm_tx_sck_in
- Transmitter tx_fsync_in = IOSS tdm_tx_fsync_in
'1': TX slave signalling inputs driven by RX Slave:
- Transmitter tx_sck_in = IOSS tdm_rx_sck_in
- Transmitter tx_fsync_in = IOSS tdm_rx_fsync_in
'2': TX slave signalling inputs driven by RX Master:
- Transmitter tx_sck_in = receiver tdm_rx_sck_out
- Transmitter tx_fsync_in = receiver tdm_rx_fsync_out

Note: MODE=0 is the default behaviour. MODE=1 or 2 is intended to allow the TX slave to share the same signaling used by the RX. This feature can be used to reduce the number of IO pins necessary to connect to an external codec supporting common TX/RX signaling. 

