RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
Note: when MODE=1 or 2, TX_TEST_CTL.ENABLED and RX_TEST_CTL.ENABLED should not be set to '1'.</description>
                  <bitRange>[1:0]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TX_IN_DRIVEN_BY_IOSS_TX_IN</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TX_IN_DRIVEN_BY_IOSS_RX_IN</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TX_IN_DRIVEN_BY_RX_OUT</name>
                      <description>N/A</description>
                      <value>2</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>TX_FIFO_CTL</name>
              <description>TX FIFO control</description>
              <addressOffset>0x80</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xF007F</resetMask>
              <fields>
                <field>
                  <name>TRIGGER_LEVEL</name>
                  <description>Trigger level. When the TX FIFO has less entries than the number of this field, a transmitter trigger event is generated:
- INTR_TX.FIFO_TRIGGER = (# FIFO entries &lt; TRIGGER_LEVEL)</description>
                  <bitRange>[6:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>MUTE</name>
                  <description>Mute functionality:
'0': HW uses TX FIFO data.
'1': HW uses a constant PCM data value of '0'. Mute does advance the FIFO read pointer.

Note: HW ensures that mute functionality synchronizes on the first channel of a frame to ensure that either all or none of the frame's channels are muted.</description>
                  <bitRange>[16:16]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FREEZE</name>
                  <description>Freeze functionality:
'0': HW uses TX FIFO data and advances the FIFO read pointer.
'1': HW uses a constant PCM data value of '0' or the previous channel PCM data is replayed. Freeze does not advance the FIFO read pointer (the FIFO data is not used).

Note: HW ensures that freeze functionality synchronizes on the first channel of a frame to ensure that PCM data of one channel is not misassigned to another channel. As a result, the freeze functionality can be activated at any time.

Note: This functionality is intended for debugging purposes.</description>
                  <bitRange>[17:17]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>ACTIVE</name>
                  <description>Activate functionality:
'0': Transmitter off. The FIFO_UNDERFLOW interrupt cause will not be activated.
'1': Transmitter on. The FIFO_UNDERFLOW interrupt may be activated (when an underflow event occurs).

Note: This functionality is intended for startup purposes.</description>
                  <bitRange>[18:18]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>REPLAY</name>
                  <description>Replay functionality (used when FREEZE is '1' or in case of a FIFO underflow event):
'0': HW uses a constant PCM data value of '0'.
'1': HW uses the previous PCM data value.</description>
                  <bitRange>[19:19]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>TX_FIFO_STATUS</name>
              <description>TX FIFO status</description>
              <addressOffset>0x84</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x7F7F00FF</resetMask>
              <fields>
                <field>
                  <name>USED</name>
                  <description>Number of used/occupied entries in the TX FIFO. The field value is in the range [0, 128]. When '0', the FIFO is empty. When '128', the FIFO is full.</description>
                  <bitRange>[7:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RD_PTR</name>
                  <description>TX FIFO read pointer: FIFO location from which a data is read.

Note: This functionality is intended for debugging purposes.</description>
                  <bitRange>[22:16]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>WR_PTR</name>
                  <description>TX FIFO write pointer: FIFO location at which a new data is written by the hardware.

Note: This functionality is intended for debugging purposes.</description>
                  <bitRange>[30:24]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>TX_FIFO_WR</name>
              <description>TX FIFO write</description>
              <addressOffset>0x88</addressOffset>
              <size>32</size>
              <access>write-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>DATA</name>
                  <description>Data (PCM sample) written to the TX FIFO. Writing adds the data to the TX FIFO; i.e. behavior is similar to that of a PUSH operation (TX_FIFO_STATUS.WR_PTR is incremented and TX_FIFO_STATUS.USED is incremented). The write data (DATA) should be right aligned when it is written to the FIFO entry (data[31:0]):
- 8 bit, data[31:0] = DATA[7:0] &lt;&lt; 24.
- 10 bit, data[31:0] = DATA[9:0] &lt;&lt; 22.
- 12 bit, data[31:0] = DATA[11:0] &lt;&lt; 20.
- 14 bit, data[31:0] = DATA[13:0] &lt;&lt; 18.
- 16 bit, data[31:0] = DATA[15:0] &lt;&lt; 16.
- 18 bit, data[31:0] = DATA[17:0] &lt;&lt; 14.
- 20 bit, data[31:0] = DATA[19:0] &lt;&lt; 12.
- 24 bit, data[31:0] = DATA[23:0] &lt;&lt; 8.
- 32 bit, data[31:0] = DATA[31:0].

Note: Writing to a full TX FIFO activates INTR.TX_FIFO_OVERFLOW.</description>
                  <bitRange>[31:0]</bitRange>
                  <access>write-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>INTR_TX</name>
              <description>Interrupt</description>
              <addressOffset>0xC0</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x107</resetMask>
              <fields>
                <field>
                  <name>FIFO_TRIGGER</name>
                  <description>HW sets this field to '1', when a TX trigger is generated.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FIFO_OVERFLOW</name>
                  <description>HW sets this field to '1', when writing to a full TX FIFO (TX_FIFO_STATUS.USED is '128').</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FIFO_UNDERFLOW</name>
                  <description>HW sets this field to '1', when reading from an (almost) empty TX FIFO (TX_FIFO_STATUS.USED &lt; 'number of enabled channels per frame'). This is referred to as an underflow event.

Note: HW ensures that either all or none of the frame's channels are transmitted. In a TX FIFO underflow situation, HW replays previous PCM data or uses a constant PCM data value of '0'.</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>IF_UNDERFLOW</name>
                  <description>HW sets this field to '1', when PCM samples are not generated in time for the interface logic (interface underflow). This may be an indication that the IP system frequency is too low wrt. the interface frequency (a SW configuration error). The interface underflow is a non-recoverable error and requires SW disabling of the channel (a SW write to INTR_TX.IF_UNDERFLOW does not resolve the interface underflow). 

Note: This functionality is intended for debug purposes.</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>INTR_TX_SET</name>
              <description>Interrupt set</description>
              <addressOffset>0xC4</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x107</resetMask>
              <fields>
                <field>
                  <name>FIFO_TRIGGER</name>
                  <description>Write this field with '1' to set corresponding INTR_TX field (a write of '0' has no effect).</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FIFO_OVERFLOW</name>
                  <description>Write this field with '1' to set corresponding INTR_TX field (a write of '0' has no effect).</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FIFO_UNDERFLOW</name>
                  <description>Write this field with '1' to set corresponding INTR_TX field (a write of '0' has no effect).</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>IF_UNDERFLOW</name>
                  <description>Write this field with '1' to set corresponding INTR_TX field (a write of '0' has no effect).</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>INTR_TX_MASK</name>
              <description>Interrupt mask</description>
              <addressOffset>0xC8</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x107</resetMask>
              <fields>
                <field>
                  <name>FIFO_TRIGGER</name>
                  <description>Mask for corresponding field in INTR_TX register.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FIFO_OVERFLOW</name>
                  <description>Mask for corresponding field in INTR_TX register.</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FIFO_UNDERFLOW</name>
                  <description>Mask for corresponding field in INTR_TX register.</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>IF_UNDERFLOW</name>
                  <description>Mask for corresponding field in INTR_TX register.</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>INTR_TX_MASKED</name>
              <description>Interrupt masked</description>
              <addressOffset>0xCC</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x107</resetMask>
              <fields>
                <field>
                  <name>FIFO_TRIGGER</name>
                  <description>Logical AND of corresponding INTR_TX and INTR_TX_MASK fields.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>FIFO_OVERFLOW</name>
                  <description>Logical AND of corresponding INTR_TX and INTR_TX_MASK fields.</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>FIFO_UNDERFLOW</name>
                  <description>Logical AND of corresponding INTR_TX and INTR_TX_MASK fields.</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>IF_UNDERFLOW</name>
                  <description>Logical AND of corresponding INTR_TX and INTR_TX_MASK fields.</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>TDM_RX_STRUCT</name>
            <description>TDM RX structure</description>
            <addressOffset>0x00000100</addressOffset>
            <register>
              <name>RX_CTL</name>
              <description>RX control</description>
              <addressOffset>0x0</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x100</resetValue>
              <resetMask>0x8001310F</resetMask>
              <fields>
                <field>
                  <name>WORD_SIZE</name>
                  <description>PCM word size:
'0': 8 bit.
'1': 10 bit.
'2': 12 bit.
'3': 14 bit.
'4': 16 bit.
'5': 18 bit.
'6': 20 bit.
'7': 24 bit.
'8': 32 bit.
'9'-'15': Undefined.</description>
                  <bitRange>[3:0]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SIZE_8</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_10</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_12</name>
                      <description>N/A</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_14</name>
                      <description>N/A</description>
                      <value>3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_16</name>
                      <description>N/A</description>
                      <value>4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_18</name>
                      <description>N/A</description>
                      <value>5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_20</name>
                      <description>N/A</description>
                      <value>6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_24</name>
                      <description>N/A</description>
                      <value>7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_32</name>
                      <description>N/A</description>
                      <value>8</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>WORD_SIGN_EXTEND</name>
                  <description>Word extension:
'0': zero extension.
'1': sign extension.</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ZERO_EXTEND</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIGN_EXTEND</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>FORMAT</name>
                  <description>Format:
'0': Left-aligned delayed.
'1': Left-aligned.
'2': Right-aligned delayed.
'3': Right-aligned.</description>
                  <bitRange>[13:12]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>LEFT_DELAYED</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>LEFT</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RIGHT_DELAYED</name>
                      <description>N/A</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RIGHT</name>
                      <description>N/A</description>
                      <value>3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MS</name>
                  <description>Master/slave setting:
'0': Slave.
- External receiver 'tdm_rx_sck_in' and receiver 'tdm_rx_fsync_in'.
'1': Master.
- Interface clock 'clk_if' is used to generate receiver 'tdm_rx_sck_out' and receiver 'tdm_rx_fsync_out'.</description>
                  <bitRange>[16:16]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SLAVE</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MASTER</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ENABLED</name>
                  <description>Receiver (RX) enable:
'0': Disabled. All non-retained MMIO registers (e.g. the RX_FIFO_STATUS and INTR_RX registers) have their fields reset to their default value.
'1': Enabled.

Note: when all transmitters and receivers are disabled, the SRAMs are driven into low power mode, if supported by the SRAM. When exiting such low power mode software needs to allow for a certain power up time before SRAM can be used, i.e. before ACTIVE can be asserted. The power up time is equivalent to the system SRAM power up time specified in the CPUSS.RAM_PWR_DELAY_CTL register (or equivalent for platforms other than MXS40).</description>
                  <bitRange>[31:31]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RX_IF_CTL</name>
              <description>RX interface control</description>
              <addressOffset>0x10</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x1F018707</resetValue>
              <resetMask>0xFF1FF7FF</resetMask>
              <fields>
                <field>
                  <name>CLOCK_DIV</name>
                  <description>Interface clock divider (legal range [1, 255]). The TDM interface 'tdm_rx_sck_out' output signals is defined as clk_if / (CLOCK_DIV + 1). CLOCK_DIV should be set to an odd value ({1, 3, 5, ..., 255}), to ensure a 50/50 percent duty cycle  clock.

Note: Used in master configuration only.

Note: Due to delays in the IO SubSystem (specifically the IO cells), the maximum TDM interface clock 'tdm_rx_sck_out' may be restricted. As a result, the maximum bitrate is less than the theoretical maximum (32 channels, 32 bits per channel and a high Fs of e.g. 48 kHz). This restriction is most applicable to the master, receiver configuration.</description>
                  <bitRange>[7:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CLOCK_SEL</name>
                  <description>Interface clock 'clk_if' selection:
'0': SRSS clock clk_if_srss[0].
'1': SRSS clock clk_if_srss[1].
'2': SRSS clock clk_if_srss[2].
'3': SRSS clock clk_if_srss[3].
'4': Master interface clock 'tdm_rx_mck_in'.
'5'-'7': undefined. 

Note: the application is always required to program this field to a value different from the default.</description>
                  <bitRange>[10:8]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SEL_SRSS_CLOCK0</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SEL_SRSS_CLOCK1</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SEL_SRSS_CLOCK2</name>
                      <description>N/A</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SEL_SRSS_CLOCK3</name>
                      <description>N/A</description>
                      <value>3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SEL_TDM_RX_MCK_IN</name>
                      <description>N/A</description>
                      <value>4</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SCK_POLARITY</name>
                  <description>Clock polarity:
'0': Clock signal is used 'as is'.
'1': Clock signal is inverted.

