RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
Note: Used in BOTH master and slave configurations.</description>
                  <bitRange>[12:12]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FSYNC_POLARITY</name>
                  <description>Channel synchronization polarity:
'0': Channel synchronization signal is used 'as is'.
'1': Channel synchronization signal is inverted.

Note: Used in BOTH master and slave configurations.</description>
                  <bitRange>[13:13]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>LATE_SAMPLE</name>
                  <description>Interface late sample sample delay:
Slave configuration (RX_CTL.MS is '0').
'0': Sample PCM bit value on rising edge (SCK_POLARITY is '0') or falling edge (SCK_POLARITY is '1') of receiver 'rx_sck_in'.
'1': Sample PCM bit value on falling edge  (SCK_POLARITY is '0') or rising edge (SCK_POLARITY is '1') of receiver 'rx_sck_in' (half a cycle delay).

Master configuration (RX_CTL.MS is '1').
'0': Sample PCM bit value on rising edge (SCK_POLARITY is '0') or falling edge (SCK_POLARITY is '1') of receiver 'rx_sck_out'.
'1': Sample PCM bit value on falling edge  (SCK_POLARITY is '0') or rising edge (SCK_POLARITY is '1') of receiver 'rx_sck_out' (half a cycle delay).

Note: This field can be set to '1' when the roundtrip delay is large (typically) in a master receiver configuration.</description>
                  <bitRange>[14:14]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>RISING</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>FALLING</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>FSYNC_FORMAT</name>
                  <description>Channel synchronization pulse format:
'0': Duration of a single bit period.
'1': Duration of the first channel.</description>
                  <bitRange>[15:15]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>BIT_PERIOD</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CH_PERIOD</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CH_NR</name>
                  <description>Number of channels in the frame:
'0': Undefined/illegal.
'1': 2 channels.
'2': 3 channels.
...
'31': 32 channels.

Note: the field value chould be less than CH_NR (the number of support channels).

Note: the RX_CH_CTL.CH_EN fields can be used to enable/disable indvidual channels.</description>
                  <bitRange>[20:16]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CH_SIZE</name>
                  <description>Channel size:
'0'-'2': Undefined/illegal.
'3': 4 bits.
...
'31': 32 bits.

Note: if RX_CTL.WORD_SIZE is greater than CH_SIZE, the lesser significant bits of the word are filled with '0's.</description>
                  <bitRange>[28:24]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SIZE_1</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_2</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_32</name>
                      <description>N/A</description>
                      <value>31</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LATE_CAPTURE</name>
                  <description>Extra delay (in 'rx_sck_out' cycles) for capturing 'tdm_rx_sd_in':
'0': no extra delay
'1': 1 cycle extra delay
'2': 2 cycles extra delay
'3': 3 cycles extra delay

Note: the value of this field pushes further out the capturing edges used by the receiver to sample 'tdm_rx_sd_in'. This function is intended to support very large round-trip delays in a master receiver configuration, where the delay at the receiver between 'tdm_rx_fsync_out' and the arrival of the first bit on 'tdm_rx_sd_in' is multiple clock cycles.</description>
                  <bitRange>[30:29]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>EXTRA_DELAY_0</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>EXTRA_DELAY_1</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>EXTRA_DELAY_2</name>
                      <description>N/A</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>EXTRA_DELAY_3</name>
                      <description>N/A</description>
                      <value>3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>I2S_MODE</name>
                  <description>I2S mode setting:
'0': TDM mode.
'1': I2S mode.</description>
                  <bitRange>[31:31]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TDM</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>I2S</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>RX_CH_CTL</name>
              <description>RX channel control</description>
              <addressOffset>0x14</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>CH_EN</name>
                  <description>Channel enables: channel i is controlled by CH_EN[i].
'0': Disabled. The RX FIFO does not consume channel i words and the received channel i words on the interface are discarded.
'1': Enabled..

Note: Only bit 0 through RX_IF_CTL.CH_NR may be set to '1'; i.e. only channels that are present in the frame can be enabled.</description>
                  <bitRange>[31:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RX_TEST_CTL</name>
              <description>RX test control</description>
              <addressOffset>0x20</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x80000000</resetMask>
              <fields>
                <field>
                  <name>ENABLED</name>
                  <description>Test mode enable.
'0': Disabled. Functional mode.
- Receiver rx_sck_in = IOSS tdm_rx_sck_in.
- Receiver rx_fsync_in = IOSS tdm_rx_fsync_in.
- Receiver rx_sd_in = IOSS tdm_rx_sd_in.
'1': Enabled. Test mode (intended to be used with (master transmitter, slave receiver) configuration).
- Receiver rx_sck_in = Transmitter tdm_tx_sck_out.
- Receiver rx_fsync_in = Transmitter tdm_tx_fsync_out.
- Receiver rx_sd_in = Transmitter tdm_tx_sd_out.

Note: TX_TEST_CTL.ENABLED and RX_TEST_CTL.ENABLED should not be set to '1' simultaneously.</description>
                  <bitRange>[31:31]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FUNCTIONAL</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TEST</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>RX_ROUTE_CTL</name>
              <description>RX route control</description>
              <addressOffset>0x24</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x3</resetMask>
              <fields>
                <field>
                  <name>MODE</name>
                  <description>Controls routing to the RX slave signalling inputs (FSYNC/SCK):
'0': RX slave signaling indipendent from TX signaling:
- Receiver rx_sck_in = IOSS tdm_rx_sck_in
- Receiver rx_fsync_in = IOSS tdm_rx_fsync_in
'1': RX slave signalling inputs driven by TX Slave:
- Receiver rx_sck_in = IOSS tdm_tx_sck_in
- Receiver rx_fsync_in = IOSS tdm_tx_fsync_in
'2': RX slave signalling inputs driven by TX Master:
- Receiver rx_sck_in = transmitter tdm_tx_sck_out
- Receiver rx_fsync_in = transmitter tdm_tx_fsync_out

Note: MODE=0 is the default behaviour. MODE=1 or 2 is intended to allow the RX slave to share the same signaling used by the TX. This feature can be used to reduce the number of IO pins necessary to connect to an external codec supporting common TX/RX signaling. 

