RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
Note: when MODE=1 or 2, TX_TEST_CTL.ENABLED and RX_TEST_CTL.ENABLED should not be set to '1'.</description>
                  <bitRange>[1:0]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>RX_IN_DRIVEN_BY_IOSS_RX_IN</name>
                      <description>N/A</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RX_IN_DRIVEN_BY_IOSS_TX_IN</name>
                      <description>N/A</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RX_IN_DRIVEN_BY_TX_OUT</name>
                      <description>N/A</description>
                      <value>2</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>RX_FIFO_CTL</name>
              <description>RX FIFO control</description>
              <addressOffset>0x80</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x6007F</resetMask>
              <fields>
                <field>
                  <name>TRIGGER_LEVEL</name>
                  <description>Trigger level. When the RX FIFO has more entries than the number of this field, a receiver trigger event is generated:
- INTR_RX.FIFO_TRIGGER = (# FIFO entries &gt; TRIGGER_LEVEL)</description>
                  <bitRange>[6:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FREEZE</name>
                  <description>Freeze functionality:
'0': HW writes to the RX FIFO and advances the FIFO write pointer.
'1': HW writes from the RX FIFO have no effect: freeze will not advance the FIFO write pointer.

Note: HW ensures that freeze functionality synchronizes on the first channel of a frame to ensure that PCM data of one channel is not misassigned to another channel. As a result, the freeze functionality can be activated at any time.

Note: This functionality is intended for debugging purposes.</description>
                  <bitRange>[17:17]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>ACTIVE</name>
                  <description>Activate functionality:
'0': Receiver off. The FIFO_OVERFLOW interrupt cause will not be activated.
'1': Receiver on. The FIFO_OVERFLOW interrupt may be activated (when an overflow event occurs).

Note: This functionality is intended for stopping purposes.</description>
                  <bitRange>[18:18]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RX_FIFO_STATUS</name>
              <description>RX FIFO status</description>
              <addressOffset>0x84</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x7F7F00FF</resetMask>
              <fields>
                <field>
                  <name>USED</name>
                  <description>Number of used/occupied entries in the RX FIFO. The field value is in the range [0, 128]. When '0', the FIFO is empty. When '128', the FIFO is full.</description>
                  <bitRange>[7:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RD_PTR</name>
                  <description>RX FIFO read pointer: FIFO location from which a data is read.

Note: This functionality is intended for debugging purposes.</description>
                  <bitRange>[22:16]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>WR_PTR</name>
                  <description>RX FIFO write pointer: FIFO location at which a new data is written by the hardware.

Note: This functionality is intended for debugging purposes.</description>
                  <bitRange>[30:24]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RX_FIFO_RD</name>
              <description>RX FIFO read</description>
              <addressOffset>0x88</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>DATA</name>
                  <description>Data (PCM sample) read from the RX FIFO. Reading removes the data from the RX FIFO; i.e. behavior is similar to that of a POP operation (RX_FIFO_STATUS.RD_PTR is incremented and RX_FIFO_STATUS.USED is decremented). The read data (DATA) is right aligned (unused bit positions follow the specified sign extension per RX_CTL.WORD_SIGN_EXTEND) when it is read from the FIFO entry (data[31:0]):
- 8 bit, DATA[7:0] = data[31:24].
- 10 bit, DATA[9:0] = data[31:22].
- 12 bit, DATA[11:0] = data[31:20].
- 14 bit, DATA[13:0] = data[31:18].
- 16 bit, DATA[15:0] = data[31:16].
- 18 bit, DATA[17:0] = data[31:14].
- 20 bit, DATA[19:0] = data[31:12].
- 24 bit, DATA[23:0] = data[31:8].
- 32 bit, DATA[31:0] = data[31:0].

Note: Reading from an empty RX FIFO activates INTR_RX.FIFO_UNDERFLOW.</description>
                  <bitRange>[31:0]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RX_FIFO_RD_SILENT</name>
              <description>RX FIFO silent read</description>
              <addressOffset>0x8C</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>DATA</name>
                  <description>N/A</description>
                  <bitRange>[31:0]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>INTR_RX</name>
              <description>Interrupt</description>
              <addressOffset>0xC0</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x107</resetMask>
              <fields>
                <field>
                  <name>FIFO_TRIGGER</name>
                  <description>HW sets this field to '1', when a RX trigger is generated.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FIFO_OVERFLOW</name>
                  <description>HW sets this field to '1', when writing to a (almost) full RX FIFO (128 -RX_FIFO_STATUS.USED &lt; 'number of enabled channels per frame'). This is referred to as an overflow event.

Note: HW ensures that either all or none of the frame's channels are received. In a RX FIFO overflow situation, HW discards received PCM data values.</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FIFO_UNDERFLOW</name>
                  <description>HW sets this field to '1', when reading from an empty RX FIFO (RX_FIFO_STATUS.USED is '0').</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>IF_OVERFLOW</name>
                  <description>HW sets this field to '1', when PCM samples are generated too fast by the interface logic (interface overflow). This may be an indication that the IP system frequency is too low wrt. the interface frequency (a SW configuration error). The interface overflow is a non-recoverable error and requires SW disabling of the channel (a SW write to INTR_RX.IF_OVERFLOW does not resolve the interface underflow).

Note: This functionality is intended for debug purposes.</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>INTR_RX_SET</name>
              <description>Interrupt set</description>
              <addressOffset>0xC4</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x107</resetMask>
              <fields>
                <field>
                  <name>FIFO_TRIGGER</name>
                  <description>Write this field with '1' to set corresponding INTR_RX field (a write of '0' has no effect).</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FIFO_OVERFLOW</name>
                  <description>Write this field with '1' to set corresponding INTR_RX field (a write of '0' has no effect).</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FIFO_UNDERFLOW</name>
                  <description>Write this field with '1' to set corresponding INTR_RX field (a write of '0' has no effect).</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>IF_OVERFLOW</name>
                  <description>Write this field with '1' to set corresponding INTR_RX field (a write of '0' has no effect).</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>INTR_RX_MASK</name>
              <description>Interrupt mask</description>
              <addressOffset>0xC8</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x107</resetMask>
              <fields>
                <field>
                  <name>FIFO_TRIGGER</name>
                  <description>Mask for corresponding field in INTR_RX register.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FIFO_OVERFLOW</name>
                  <description>Mask for corresponding field in INTR_RX register.</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>FIFO_UNDERFLOW</name>
                  <description>Mask for corresponding field in INTR_RX register.</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>IF_OVERFLOW</name>
                  <description>Mask for corresponding field in INTR_RX register.</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>INTR_RX_MASKED</name>
              <description>Interrupt masked</description>
              <addressOffset>0xCC</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x107</resetMask>
              <fields>
                <field>
                  <name>FIFO_TRIGGER</name>
                  <description>Logical AND of corresponding INTR_RX and INTR_RX_MASK fields.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>FIFO_OVERFLOW</name>
                  <description>Logical AND of corresponding INTR_RX and INTR_RX_MASK fields.</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>FIFO_UNDERFLOW</name>
                  <description>Logical AND of corresponding INTR_RX and INTR_RX_MASK fields.</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>IF_OVERFLOW</name>
                  <description>Logical AND of corresponding INTR_RX and INTR_RX_MASK fields.</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
