RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
Note: To drive on the falling edge of the PDM interface clock clk_pdm, DRIVE_DELAY should be set to IF_CTL.CLOCK_DIV/2. To drive on the rising edge of clk_pdm, DRIVE_DELAY should be set to IF_CTL.CLOCK_DIV.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVE_DELAY_LO</name>
              <description>Interface drive delay on the low phase of the PDM interface clock. This field specifies when a PDM value is driven expressed in clk_if clock cycles. DRIVE_DELAY should be set in the range [0, IF_CTL.CLOCK_DIV]:
'0': Drive PDM value 1 clk_if cycle after the rising edge of clk_pdm.
'1': Drive PDM value 2 clk_if cycles after the rising edge of clk_pdm.
...
'255': Drive PDM value 256 clk_if cycles after the rising edge of clk_pdm.

Note: To drive on the falling edge of the PDM interface clock clk_pdm, DRIVE_DELAY should be set to IF_CTL.CLOCK_DIV/2. To drive on the rising edge of clk_pdm, DRIVE_DELAY should be set to IF_CTL.CLOCK_DIV.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE_HI</name>
              <description>Pattern generator mode on the high phase of the PDM interface clock. This field specifies the type of PDM pattern driven by the generator:
'0': constant 0's
'1': constant 1's
'2': alternating 0's and 1's (clock pattern)
'3': sinusoid</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONSTANT_0</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONSTANT_1</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALTERNATING</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINUSOID</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE_LO</name>
              <description>Pattern generator mode on the low phase of the PDM interface clock. This field specifies the type of pattern driven by the generator:
'0': constant 0's
'1': constant 1's
'2': alternating 0's and 1's (clock pattern)
'3': sine wave</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONSTANT_0</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONSTANT_1</name>
                  <description>N/A</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALTERNATING</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINUSOID</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDIO_FREQ_DIV</name>
              <description>Frequency division factor (legal range [3, 13]) to obtain audio frequency from the PDM clock frequency. This field determines the frequency of the sine wave generated by the pattern generator when MODE=3. The formula is below:

Sine wave Frequency = PDM clock frequency / 2p*2^(AUDIO_FREQ_DIV)

Example: when PDM clock frequency = 3.072 MHz the audio frequencies obtained for the various values of AUDIO_FREQ_DIV are shown below:

'3' : 61.115 kHz
'4' : 30.558 kHz
'5' : 15.279 kHz
'6' : 7.639 kHz
'7' : 3.820 kHz
'8' : 1.910 kHz
'9' : 955 Hz
'10' : 477 Hz
'11' : 239 Hz
'12' : 119 Hz
'13' : 60 Hz</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_PDM_FREQ_BY_2PI_x_8</name>
                  <description>Example: 3.072 MHz/(2p*8) = 61.115 kHz</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_PDM_FREQ_BY_2PI_x_16</name>
                  <description>Example: 3.072 MHz/(2p*16) = 30.558 kHz</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_PDM_FREQ_BY_2PI_x_8192</name>
                  <description>Example: 3.072 MHz/(2p*8192) = 60 Hz</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH_ENABLED</name>
              <description>Pattern generator enable (1 bit for each channel):
'0' : disabled, the channel input is taken as normal from external pin pdm_data_in
'1' : enabled, the channel input is taken from the pattern generator

Note: the pattern generator output is routed to pdm_data_out for testing purposes

Note: when all channels are disabled the pattern generator is switched off</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR0_COEFF0</name>
          <description>FIR 0 coefficients 0</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 0 and 29 coefficient.</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 1 and 28 coefficient.</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR0_COEFF1</name>
          <description>FIR 0 coefficients 1</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 2 and 27 coefficient.</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 3 and 26 coefficient.</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR0_COEFF2</name>
          <description>FIR 0 coefficients 2</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 4 and 25 coefficient.</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 5 and 24 coefficient.</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR0_COEFF3</name>
          <description>FIR 0 coefficients 3</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 6 and 23 coefficient.</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 7 and 22 coefficient.</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR0_COEFF4</name>
          <description>FIR 0 coefficients 4</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 8 and 21 coefficient.</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 9 and 20 coefficient.</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR0_COEFF5</name>
          <description>FIR 0 coefficients 5</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 10 and 19 coefficient.</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 11 and 18 coefficient.</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR0_COEFF6</name>
          <description>FIR 0 coefficients 6</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 12 and 17 coefficient.</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 13 and 16 coefficient.</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR0_COEFF7</name>
          <description>FIR 0 coefficients 7</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter tap 14 coefficient.</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter tap 15 coefficient.</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR1_COEFF0</name>
          <description>FIR 1 coefficients 0</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x153FFE</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 0 and 54 coefficient (default value -2).</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 1 and 53 coefficient (default value 21).</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR1_COEFF1</name>
          <description>FIR 1 coefficients 1</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FEF001A</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 2 and 52 coefficient (default value 26).</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 3 and 51 coefficient (default value -17).</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR1_COEFF2</name>
          <description>FIR 1 coefficients 2</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x193FD7</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 4 and 50 coefficient (default value -41).</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 5 and 49 coefficient (default value 25).</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR1_COEFF3</name>
          <description>FIR 1 coefficients 3</description>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FDF0044</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 6 and 48 coefficient (default value 68).</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 7 and 47 coefficient (default value -33).</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR1_COEFF4</name>
          <description>FIR 1 coefficients 4</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x293F95</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 8 and 46 coefficient (default value -107).</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 9 and 45 coefficient (default value 41).</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR1_COEFF5</name>
          <description>FIR 1 coefficients 5</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FD000A0</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 10 and 44 coefficient (default value 160).</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 11 and 43 coefficient (default value -48).</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR1_COEFF6</name>
          <description>FIR 1 coefficients 6</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x363F1A</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 12 and 42 coefficient (default value -230).</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 13 and 41 coefficient (default value 54).</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR1_COEFF7</name>
          <description>FIR 1 coefficients 7</description>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FC80145</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 14 and 40 coefficient (default value 325).</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 15 and 39 coefficient (default value -56).</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR1_COEFF8</name>
          <description>FIR 1 coefficients 8</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x333E3B</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 16 and 38 coefficient (default value -453).</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 17 and 37 coefficient (default value 51).</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR1_COEFF9</name>
          <description>FIR 1 coefficients 9</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FE10277</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 18 and 36 coefficient (default value 631).</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 19 and 35 coefficient (default value -31).</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR1_COEFF10</name>
          <description>FIR 1 coefficients 10</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FEB3C82</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 20 and 34 coefficient (default value -894).</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 21 and 33 coefficient (default value -21).</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR1_COEFF11</name>
          <description>FIR 1 coefficients 11</description>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xAC052E</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 22 and 32 coefficient (default value 1326).</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 23 and 31 coefficient (default value 172).</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIR1_COEFF12</name>
          <description>FIR 1 coefficients 12</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3CFE3771</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 24 and 30 coefficient (default value -2191).</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 25 and 29 coefficient (default value -770).</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
