RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
        <register>
          <name>FIR1_COEFF13</name>
          <description>FIR 1 coefficients 13</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1FFF12FB</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Filter taps 26 and 28 coefficient (default value 4859).</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Filter taps 27 (center tap) coefficient (default value 8191).</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>2</dim>
          <dimIncrement>256</dimIncrement>
          <name>CH[%s]</name>
          <description>PDM RX structure</description>
          <addressOffset>0x00008000</addressOffset>
          <register>
            <name>CTL</name>
            <description>Control</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x100</resetValue>
            <resetMask>0x8000010F</resetMask>
            <fields>
              <field>
                <name>WORD_SIZE</name>
                <description>PCM word size:
'0': 8 bit.
'1': 10 bit.
'2': 12 bit.
'3': 14 bit.
'4': 16 bit.
'5': 18 bit.
'6': 20 bit.
'7': 24 bit.
'8': 32 bit.
'9'-'15': Undefined.</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SIZE_8</name>
                    <description>N/A</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIZE_10</name>
                    <description>N/A</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIZE_12</name>
                    <description>N/A</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIZE_14</name>
                    <description>N/A</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIZE_16</name>
                    <description>N/A</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIZE_18</name>
                    <description>N/A</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIZE_20</name>
                    <description>N/A</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIZE_24</name>
                    <description>N/A</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIZE_32</name>
                    <description>N/A</description>
                    <value>8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WORD_SIGN_EXTEND</name>
                <description>Word extension:
'0': zero extension.
'1': sign extension.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ZERO_EXTEND</name>
                    <description>N/A</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIGN_EXTEND</name>
                    <description>N/A</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENABLED</name>
                <description>Receiver enable:
'0': Disabled. If a receiver is disabled, all non-retained MMIO registers (e.g. the RX_FIFO_STATUS and INTR_RX registers) have their fields reset to their default value.

'1': Enabled.

Note: when all receivers are disabled, the SRAMs are driven into low power mode, if supported by the SRAM. When exiting such low power mode software needs to allow for a certain power up time before SRAM can be used, i.e. before ACTIVE can be asserted. The power up time is equivalent to the system SRAM power up time specified in the CPUSS.RAM_PWR_DELAY_CTL register (or equivalent for platforms other than MXS40).</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IF_CTL</name>
            <description>Interface control</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x3</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>SAMPLE_DELAY</name>
                <description>Interface sample delay. This field specifies when a PDM value is captured, expressed in clk_if clock cycles. 

When CLOCK_CTL.HALVE=0:
'0': Capture PDM value 1 clk_if cycle after the rising edge of clk_pdm.
'1': Capture PDM value 2 clk_if cycles after the rising edge of clk_pdm.
...
'255': Capture PDM value 256 clk_if cycles after the rising edge of clk_pdm.

When CLOCK_CTL.HALVE=1:
'0': Capture PDM value 1 and 2 clk_if cycles after the rising edge of clk_pdm.
'1': Capture PDM value 3 and 4 clk_if cycles after the rising edge of clk_pdm.
...
'255': Capture PDM value 511 and 512 clk_if cycles after the rising edge of clk_pdm.

