RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
With CLIP24(a) defined as:
   if      (a &gt;= 0x7f:ffff) result =  0x7f:ffff;
   else if (a &lt; -0x80:0000) result = -0x80:0000;
   else                     result = a;

Note: Clipping is not necessary for larger SCALE values, as the scaled value is guarneteed to be within the 24-bit signed integer range.</description>
                <bitRange>[12:8]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SCALE_0</name>
                    <description>N/A</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SCALE_1</name>
                    <description>N/A</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SCALE_31</name>
                    <description>N/A</description>
                    <value>31</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENABLED</name>
                <description>FIR 1 filter coefficient enable (does NOT effect FIR filter scaling and FIR filter decimation):
'0': Disabled. The middle FIR filter coefficient (28th coefficient, or tap 27 in [0:54] range) is '1' and all other FIR filter coefficients are '0'; i.e. the FIR filter is a pass through filter and the filter gain is '1'.
   fir1_pcm[43:0] = fir0_scaled_pcm[25:0] (with sign extension)
'1': Enabled.

Note: Disabling of the filter functionality is provided for debug purposes.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DC_BLOCK_CTL</name>
            <description>DC block control</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x80000001</resetValue>
            <resetMask>0x80000007</resetMask>
            <fields>
              <field>
                <name>CODE</name>
                <description>DC blocker coefficient. The DC blocker is defined as:

dc_block_state_scaled(n-1) = 
       dc_block_state(n-1) 
     - (dc_block_state(n-1) &gt;&gt; (12-CODE))
dc_block_state(n)          = CLIP37 (
       2^13 * (fir1_scaled_pcm(n) - fir1_scaled_pcm(n-1))
     + dc_block_state_scaled(n-1))
dc_block_pcm(n)            = dc_block_state(n) &gt;&gt; 13

This first step is a scaling step of the DC block state. It effectively multiplies the DC block state with a variable 'alpha' that is close to '1': 
'0': alpha = 1 - (1/2^(12-0)) = 0.999755859.
'1': alpha = 1 - (1/2^(12-1)) = 0.999511719.
'2': alpha = 1 - (1/2^(12-2)) = 0.999023438.
'3': alpha = 1 - (1/2^(12-3)) = 0.998046875.
'4': alpha = 1 - (1/2^(12-4)) = 0.99609375.
'5': alpha = 1 - (1/2^(12-5)) = 0.9921875.
'6': alpha = 1 - (1/2^(12-6)) = 0.984375.
'7': alpha = 1 - (1/2^(12-7)) = 0.96875.</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CODE_1</name>
                    <description>N/A</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CODE_2</name>
                    <description>N/A</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CODE_4</name>
                    <description>N/A</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CODE_8</name>
                    <description>N/A</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CODE_16</name>
                    <description>N/A</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CODE_32</name>
                    <description>N/A</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CODE_64</name>
                    <description>N/A</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CODE_128</name>
                    <description>N/A</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENABLED</name>
                <description>DC blocker enable:
'0': Disabled. The functionality is defined as:
dc_block_pcm(n) = fir1_scaled_pcm(n)
'1': Enabled. The functionality is as specified by the CODE field.

Note: disabling of the DC blocker filter functionality is provided for debug purposes.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RX_FIFO_CTL</name>
            <description>RX FIFO control</description>
            <addressOffset>0x80</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x2003F</resetMask>
            <fields>
              <field>
                <name>TRIGGER_LEVEL</name>
                <description>Trigger level. When the RX FIFO has more entries than the number of this field, a receiver trigger event is generated:
- INTR_RX.FIFO_TRIGGER = (# FIFO entries &gt; TRIGGER_LEVEL)</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EMPTY</name>
                    <description>N/A</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USED_1</name>
                    <description>N/A</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USED_63</name>
                    <description>N/A</description>
                    <value>63</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FREEZE</name>
                <description>Freeze functionality:
'0': HW writes to the RX FIFO and advances the FIFO write pointer.
'1': HW writes from the RX FIFO have no effect: freeze will not advance the FIFO write pointer.

Note: This functionality is intended for debugging purposes.</description>
                <bitRange>[17:17]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RX_FIFO_STATUS</name>
            <description>RX FIFO status</description>
            <addressOffset>0x84</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F3F007F</resetMask>
            <fields>
              <field>
                <name>USED</name>
                <description>Number of used/occupied entries in the RX FIFO. The field value is in the range [0, 64]. When '0', the FIFO is empty. When '64', the FIFO is full.</description>
                <bitRange>[6:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RD_PTR</name>
                <description>RX FIFO read pointer: FIFO location from which a data is read.

Note: This functionality is intended for debugging purposes.</description>
                <bitRange>[21:16]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>WR_PTR</name>
                <description>RX FIFO write pointer: FIFO location at which a new data is written by the hardware.

Note: This functionality is intended for debugging purposes.</description>
                <bitRange>[29:24]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RX_FIFO_RD</name>
            <description>RX FIFO read</description>
            <addressOffset>0x88</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data (PCM sample) read from the RX FIFO. Reading removes the data from the RX FIFO; i.e. behavior is similar to that of a POP operation (RX_FIFO_STATUS.RD_PTR is incremented and RX_FIFO_STATUS.USED is decremented). The read data (DATA) is right aligned (unused bit positions follow the specified sign extension per CTL.WORD_SIGN_EXTEND) when it is read from the FIFO entry (data[23:0]):
- 8 bit, DATA[7:0] = data[23:16].
- 10 bit, DATA[9:0] = data[23:14].
- 12 bit, DATA[11:0] = data[23:12].
- 14 bit, DATA[13:0] = data[23:10].
- 16 bit, DATA[15:0] = data[23:8].
- 18 bit, DATA[17:0] = data[23:6].
- 20 bit, DATA[19:0] = data[23:4].
- 24 bit, DATA[23:0] = data[23:0].
- 32 bit, DATA[31:0] = data[23:0] &lt;&lt; 8.

