RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/svd/cyw20829.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MXKEYSCAN</name>
      <description>0</description>
      <baseAddress>0x40920000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>KEYSCAN_CTL</name>
          <description>Keyscan Control Reg</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x79FCC</resetValue>
          <resetMask>0x7FFDD</resetMask>
          <fields>
            <field>
              <name>KS_EN</name>
              <description>Enable the key scan module for keyboard function; specifically, the desired clock to the keyscan module is enabled.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GHOST_EN</name>
              <description>Enable ghost detection</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KS_INT_EN</name>
              <description>This bit enables the keyscan block to wake the MCU module if key is detected.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KYS_RST_EN</name>
              <description>Enable the reset of the debounce counters with kys_reported_clr bit; the reset clears the following registers: read/write counters for the event FIFO, debounce buffers, debouce counters, debouce up/down registers, cycle tracking registers and the keyscan read counter. For reset to take effect, the following two bits have to be set during clock unfreeze: this kys_rst_en and the 'reported_clear_kys' bit (note: ks_en can be at either states).</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RC_EXT</name>
              <description>Programmable idle duration between column scans.  For example, rc_ext[1:0] = 1 will provide 1 clock cycle idle time of no column scan. This is to alleviate the problem of slow RC delay on some of the keyboard design. The valid values for rc_ext are 1, 2, and 3 (default)</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCTC_ROW</name>
              <description>set the number of rows of the key matrx; program to one less than the number of row in the keyboard.(default 7)</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCTC_COLUMN</name>
              <description>set the number of columns of the key matrx; program to one less than the number of column in the keyboard (default 19)</description>
              <bitRange>[15:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULL_HIGH</name>
              <description>used to pull the columns high after each column scan to alleviate slow rise-time due to a large key matrix capacitance;default is on.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KSI_DRV_HIGH</name>
              <description>(THIS IS NOT USED and implemented in RTL) when in keyboard application this bit enables KSI rows to be outputs and driven high to accelerate the pull-up resistor effect for avoiding false key detection due to otherwise slow rising node</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KYSCLK_STAYON</name>
              <description>the keyscan clock will stay on when set; otherwise, the clock will be gated off by when no activity is detected</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBOUNCE</name>
          <description>Debounce (micro/macro)</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x333</resetValue>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>MD_DEBOUNCE</name>
              <description>macro down debounce count</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MU_DEBOUNCE</name>
              <description>macro up debounce count</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U_DEBOUNCE</name>
              <description>set the micro debounce count</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYFIFO_CNT</name>
          <description>Number of entries in Key FIFO</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>KEYFIFO_CNT</name>
              <description>This register indicates the number of event that is ready for firmware access in the keycode event FIFO. Firmware to read this register before accessing the keycode event FIFO register. For example, a 1 on this register indicates that there is one event in the keycode event FIFO, so firmware can issue a read to the keycode event FIFO once. This number of key event is the accumulative key event count that is latched at the end of each hardware scan frame in a buffer register, it is then transferred to this event register when the 'freeze' is issued; its value is cleared when 'reported_clear_kys' bit is set in the mia_ctl_adr register. 
Note:
Overflow condition (more than 20 keys detected in the scan cycle) may occur before the whole frame is scanned. If the 'overflow' bit is set and the keyfifo_cnt_adr register contains value that is less than 20, firmware needs to read this register a 2nd time. The balance of the event count will be automatically loaded into this register when the firmware issued 'reported_clear_kys' and 'unfreeze' if the hardware scan frame where overflow occurred has completed. However, perform a kys_rst_en maybe a better</description>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYFIFO</name>
          <description>KEYFIFO values</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC00000FF</resetMask>
          <fields>
            <field>
              <name>KEYFIFO</name>
              <description>contains detected key index; the event FIFO is 20-byte deep. After power up reset or soft reset defined by the 'kys_rst_en' bit, the event FIFO will contain 0xFF values.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRACK_SCAN_CYCLE</name>
              <description>a 1 or 0 value that indicates the hardware scan cycle that the key was detected; any key detected in the same hardware scan cycle will have the same track_cycle value. It toggles between 0 &amp; 1 whenever a key in a scan cycle is detected; in other words, this value doesn't change when there is no key detected in the current scan cycle</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_UP_DOWN</name>
              <description>indicator of key up (1) or down (0) for each key entry in the FIFO. Each of these bits are associated with the key code at bit[7:0].</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIA_CTL</name>
          <description>MIA CTL (legacy)</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>FREEZE_MIA</name>
              <description>This bit when set will latch the accumulated key event count for firmware to access via the keyfifo_cnt_adr. After setting the freeze' bit, firmware needs to poll the 'clkrc_freezed' bit (synchronized to the 24MHz clock in hardware) in the 'mia_status_adr' register until it goes high, at which time read access to keyfifo_cnt &amp; keyfifo_adr can proceed. After read access, firmware need to set this bit to low. The typical latency for freeze is 2.5 cycle of the 128KHz clock ~ 19.5us. Note: the clock in the keyscan module is not stopped when the freeze bit is set.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REPORTED_CLEAR_KYS</name>
              <description>After reading the MIA registers, firmware set this bit to instruct the MIA keyscan module to clear the keycode status, ghost status, &amp; other internal registers. It is important that firmware clears and sets the bit properly (Read/write by uP). It is important to note that this bit only takes effect when the unfreeze occurs - it is a logical AND between this bit and the unfreeze that clears the registers. Therefore, it is advise that the firmware enters into any 'freeze operation' with the 'reported_clear_kys' bit cleared. (read/writable by uP, read only by MIA)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_LF_SEL</name>
              <description>There is a potential bug when CLK_LF_SEL=1, based on the internals of the mxtk_clk_dividere used, and the output of the divider could be stuck.  Please don't change this register unless there is a desperate need to debug the CLK_MF and switch over to only CLK_LF. ORIGINAL desicription: [Run the mxkeyscan internal processor at 32.786kHz, which will only work for small keypad sizes, and is an extreme way to lower power.  Default is to use the 2MHz clk_mf source from the IMO]</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIA_STATUS</name>
          <description>MIA STAUS (Legacy)</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x6F</resetMask>
          <fields>
            <field>
              <name>MIA_CLOCK_FREEZED_STATUS</name>
              <description>Firmware needs to poll this bit when trying to access/read the MIA registers. When this bit is high, the 'freeze' (bit 1 of the ksctl_adr register) is successful. Read access may proceed, otherwise, firmware has to wait and poll this bit until it is high. This bit is write by MIA and readable by the uP.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>KEYCODE_SET_STATUS</name>
              <description>(Note: these bits can be read anytime, no need to freeze the MIA clock)

keycode_set indiates that the there is event in the key event FIFO.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OVERFLOW_STATUS</name>
              <description>(Note: these bits can be read anytime, no need to freeze the MIA clock)
key FIFO overflow: The 20-byte key event FIFO overflows; more than 16 keys are pressed during current scan interval.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GHOST_STATUS</name>
              <description>(Note: these bits can be read anytime, no need to freeze the MIA clock)
Ghost: indicates the ghost keys are detected; 0xF5 is inserted in the event FIFO. Refer to keyscan_ctl_adr for ghost enable bit.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>KYS_INT_SYNC_STATUS</name>
              <description>(Note: these bits can be read anytime, no need to freeze the MIA clock)

kys_int_sync: status indicating that the keyscan interrupt is set. Refer to keyscan_ctl_adr for keyscan interruptenable - ks_int_en.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_G_TO_KYS_DBG</name>
              <description>Debug status bit, poll this to see if the clock toggles and the divider is working.  Double synced to clk_sys domain as an observe point also should help dft</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KSI_USED</name>
          <description>Number of input key rows</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>KSI_USED</name>
              <description>define the number of row used for Keyscan; this definition is the same as that of the rctc register defined in MIA keyscan_ctl_adr[10:8]</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>Interrupt</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>KEY_EDGE</name>
              <description>HW sets this field to '1', when a INTERRUPT_KEY_EDGE trigger is generated.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFO_THRESH</name>
              <description>HW sets this field to '1', when a INTERRUPT_FIFO_THRESH trigger is generated.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_SET</name>
          <description>Interrupt set</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>KEY_EDGE</name>
              <description>Write this field with '1' to set corresponding INTR field (a write of '0' has no effect).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFO_THRESH</name>
              <description>Write this field with '1' to set corresponding INTR field (a write of '0' has no effect).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MASK</name>
          <description>Interrupt mask</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>KEY_EDGE</name>
              <description>Mask for corresponding field in INTR register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFO_THRESH</name>
              <description>Mask for corresponding field in INTR register.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MASKED</name>
          <description>Interrupt mask</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>KEY_EDGE</name>
              <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFO_THRESH</name>
              <description>Logical AND of corresponding INTR and INTR_MASK fields.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
